{
    "74318012": {
        "Job Title": "Software Developer (Technical Operations), NSCC",
        "Company Name": "Agency for Science, Technology and Research (A*STAR)",
        "Company ID": "60482659",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/0811ee35-6514-43b9-92de-047abe304449.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T05:20:04Z",
        "Job Salary": "",
        "Job Teaser": "Software Developer",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74318012",
        "Job Details Sections": [
            "As a Software Developer, you will be a key player in designing, implementing, and maintaining software solutions that facilitate the analysis and interpretation of scientific data. This role offers a unique opportunity to contribute to the development of cutting-edge tools and applications that empower our stakeholders in their pursuit of groundbreaking discoveries.Key Responsibilities:",
            "Scientific Platform development: Design, develop, and maintain a platform for research using HPC and artificial intelligence (AI) technologies.",
            "Workflow development: Implement software systems, tools, and algorithms with relevant databases and develop workflows that support the analysis, visualization, and interpretation of large and complex scientific data sets. Organize workshops and tutorials to facilitate uptake of these workflows by NSCC users.",
            "Partnerships: Develop and maintain partnerships with academic, research, government, and industry partners, to ensure the successful integration of HPC and AI technologies into their research and development activities.",
            "Upskilling: Stay up-to-date with the latest developments in HPC and AI technologies, and identify new and innovative ways to leverage these technologies to support scientific research.",
            "Collaboration: Collaborate with scientists, engineers, and other stakeholders to identify and solve complex technical challenges, and to design and implement innovative solutions.",
            "Planning: Contribute to the development and implementation of project plans, schedules, and budgets, ensuring that resources are allocated effectively and efficiently to meet the needs of the organization.",
            "Reporting: Communicate findings through presentations, and reports for NSCC as well as stakeholders/collaborators.",
            "Quality assurance: Ensure compliance with relevant regulations, policies, and best practices, and implement measures to protect the confidentiality, integrity, and availability of HPC and AI systems and data.",
            "Qualifications:",
            "Bachelor\"s/Master\"s/PhD degree in Data Science, Computer Science, or a related field.",
            "Proven experience in Singularity or similar workflow design, development, and optimization.",
            "Proficiency in relevant programming languages (e.g. SQL, BASH, C/C++, Fortran, Javascript, Python).",
            "Experience with Linux development environment and toolchains (e.g. GCC, Clang, Intel compilers).",
            "Experience with server-based and high-performance computing.",
            "Familiarity with bioinformatics tools and resources, and an understanding of biological data types and formats.",
            "Familiarity with Linux command line, system administration, scripting, and software tools.",
            "Familiarity with performance and memory profiling tools, and debugging tools.",
            "Familiarity with software version control process and tools (e.g. git, github, gitlab).",
            "Strong problem-solving skills and the ability to work collaboratively in a dynamic team environment."
        ]
    },
    "74247781": {
        "Job Title": "INTERN (IT&S, IT Operations & Data Centre - Software Developer)",
        "Company Name": "Singapore Power Ltd",
        "Company ID": "60257919",
        "Company Area": "Geylang",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/47c7b0a7-1d4f-4c42-8ed1-e0e567abbb81.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T06:14:34Z",
        "Job Salary": "",
        "Job Teaser": "This internship position is available Full-Time for May to Jul (Summer) and Aug to Dec (Semester) intakes.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74247781",
        "Job Details Sections": [
            "This internship position is available Full-Time for May to Jul (Summer) and Aug to Dec (Semester) intakes.",
            "",
            "To analyse operations data for pre-emptive warnings to avoid incidents and to improve the availability and uptime of our system, as well as capacity planning.",
            "",
            "Skill Requirements",
            "1. Strong organisational and analytical skills 2. Strong verbal and written communication skills 3. A team player with positive working attitude4. Data analytics, tools and scripting",
            ""
        ]
    },
    "74225441": {
        "Job Title": "Software Developer",
        "Company Name": "Fleischhacker LLP",
        "Company ID": "60505500",
        "Company Area": "Toa Payoh",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/a332125f-95fe-4be1-afb3-17d4cdf95c7f.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T08:30:51Z",
        "Job Salary": "",
        "Job Teaser": "Job Responsibilities: Participate in requirements analysis. Collaborate with development teams to develop software solutions using microservice...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74225441",
        "Job Details Sections": [
            "Job Responsibilities:",
            "Participate in requirements analysis.",
            "Collaborate with development teams to develop software solutions using microservice architecture.",
            "Design, build and maintain software applications and APIs for new and existing backend services.",
            "Produce code following best practices and standard using .NET programming languages.",
            "Test and deploy applications and systems.",
            "",
            "Requirements:",
            "Degree in Computer Science/Information Technology or related discipline.",
            "Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3.",
            "Strong knowledge of SQL (MS-SQL / SQL Server).",
            "Prior experience in developing software applications with ASP.Net, API and Microservices.",
            "Understanding of Agile methodologies.",
            "Experience in Cloud Platform & Services is a plus.",
            "Knowledge of the healthcare industry will be an added advantage.",
            "",
            "We regret to inform that only shortlisted candidates will be notified."
        ]
    },
    "74274934": {
        "Job Title": "Senior Software Engineer – Full Stack Developer, DxD Hub",
        "Company Name": "Agency for Science, Technology and Research (A*STAR)",
        "Company ID": "60482659",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/0811ee35-6514-43b9-92de-047abe304449.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T07:24:04Z",
        "Job Salary": "",
        "Job Teaser": "Senior Software Engineer – Full Stack Developer, DxD Hub",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74274934",
        "Job Details Sections": [
            "We are seeking an experienced Senior Software Developer to spearhead new product development. In this role, you will play a crucial role in driving the successful execution of digital health products in collaboration with external partners. The ideal candidate should possess a strong background in frontend and backend development, extensive hands-on cloud experience, familiarity with regulatory standards (especially IEC 62304), and a successful track record in the full software development lifecycle.",
            "Responsibilities:",
            "·       Full Stack Development: Lead the design, development, and maintenance of both frontend and backend components for software medical devices.",
            "·       Cloud Expertise: Utilize hands-on experience in cloud technologies (AWS, Azure, GCP) to architect and deploy scalable and secure applications.",
            "·       SDLC Leadership: Demonstrate expertise in multiple projects by managing the complete software development lifecycle from inception to deployment and maintenance.",
            "·       Regulatory Compliance: Ensure software development processes adhere to relevant regulatory standards, especially IEC 62304 for medical device software lifecycle processes.",
            "·       Software Testing: Lead or contribute significantly to software testing strategies, verification, and validation processes to ensure compliance and reliability.",
            "·       Mobile App Development: Lead or contribute significantly to the development of mobile applications for iOS and Android platforms.",
            "·       Collaboration and Mentorship: Collaborate effectively with external partners, startups, and industry collaborators while providing technical guidance and mentorship to team members.",
            "Requirements:",
            "·       Bachelor’s degree in Computer Science, Engineering, or related field; Master’s degree preferred.",
            "·       3+ years of hands-on experience in software development, specifically focusing on both frontend and backend technologies.",
            "·       Proficiency in frontend frameworks (e.g., React, Angular, Flutter, Firebase) and backend frameworks (e.g., Node.js, Express, Django, Flask). Candidates with",
            "·       Proficient in working with SQL and NoSQL databases such as MongoDB, Redis, Firestore, MySQL.",
            "·       Strong hands-on experience with cloud technologies (AWS, Azure) and deploying applications in cloud environments.",
            "·       Demonstrated experience in the full software development lifecycle across multiple projects.",
            "·       Familiarity with regulatory standards in healthcare, particularly IEC 62304 for medical device software lifecycle processes.",
            "·       Proven track record of leading or participating in projects from initiation to completion.",
            "·       Mobile app development experience for both iOS and Android platforms.",
            "·       Expertise in software testing, verification, and validation processes for ensuring compliance and reliability.",
            "·       Experience in developing multitenant applications will be given preference.",
            "·       Experience in working with FHIR, EHR systems, medical software, or digital health apps is a plus."
        ]
    },
    "74309935": {
        "Job Title": "IT Programmer",
        "Company Name": "ASE Singapore Pte Ltd",
        "Company ID": "60286023",
        "Company Area": "Woodlands",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/92cd773d-5a29-49f3-a607-12ac103ed830.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T01:51:27Z",
        "Job Salary": "",
        "Job Teaser": "ASE Singapore is currently seeking an IT Programmer whose main role is to develop and enhance in-house software applications.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74309935",
        "Job Details Sections": [
            "Responsibilities:",
            "Design and develop in-house software applications for automation/work flow projects.",
            "Enhance existing applications based on users/customers’ requirements.",
            "Gather In-House User and System requirements for new and existing projects.",
            "Perform UAT (User Acceptance Tests) with users before deploying the solution.",
            "Provide end user-training and support for existing and newly developed applications.",
            "Requirements:",
            "Degree in Information Technology/Computer Science/Computer Engineering, preferably specializing in software development.",
            "Good knowledge in C# .NET, ASP .NET Core, Python and PostgresSQL or other programming languages.",
            "Experience with web development and programming.",
            "Able to multitask in an extremely dynamic environment, initiating necessary tasks and ensuring complete follow up.",
            "Good communication and interpersonal skills."
        ]
    },
    "74263422": {
        "Job Title": "Software Engineer (UI)",
        "Company Name": "D-SIMLAB TECHNOLOGIES PTE LTD",
        "Company ID": "60522350",
        "Company Area": "Jurong East",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/16fabf15-f84e-4201-9bb7-6fae2aeecc73.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T03:27:55Z",
        "Job Salary": "$4,000 – $6,000 per month",
        "Job Teaser": "SOFTWARE ENGINEER (UI)",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74263422",
        "Job Details Sections": [
            "About D-SIMLAB",
            "",
            "D-SIMLAB Technologies Pte Ltd is a leading provider of high-performance, simulation-based business analytics and process optimisation solutions, currently focusing on developing solutions for optimisation of Wafer Fabrication companies within the Semiconductor Manufacturing Industry. An international company with growing reputation and international blue chip customer base, D-SIMLAB is growing its team in China.",
            "",
            "Job Description for Software Engineer (UI)",
            "",
            "As a Software Engineer (UI) in D-SIMLAB, you will get exposure in both technical and soft skills development. The role does not limit to only software development, but also involves in providing professional consultation services to customers, with the following key responsibilities:",
            "",
            "· Work together with a team of highly skilled Software Engineers and Data Scientists in software product deployment and delivery at world leading semiconductor manufacturers",
            "· Actively involved in product enhancement (in the area of visualization and algorithms) which improves the quality of D-SIMLAB products",
            "· Responsible for key software UI component development with efficient, clean and maintainable code",
            "· Understand and design the overall functionality of the products and projects",
            "· Collaborate with cross-functional teams to define, design and deliver new features",
            "",
            "We are looking for candidates fulfil the following criteria:",
            "",
            ". Bachelor/Master Degree specializes in Computer Science/Engineering",
            "· Minimum 3 years’ experience in software product development",
            "· Mastery of C#, .NET, CSS, HTML, Webservice, API, SQL",
            "· Strong understanding of front-end coding and development techniques",
            "· Ensure the best possible performance, responsiveness, and accuracy of applications",
            "· Prepare documentations for details system requirements",
            "· Ability to work in a fast-paced, dynamic environment and adapt to changing requirements",
            "· Enjoy working with experts with different cultural and technical backgrounds",
            "· Love to travel the world and work on challenging projects",
            "· Interest in career progression by strengthening technical and soft skills"
        ]
    },
    "74194049": {
        "Job Title": "Software Engineer",
        "Company Name": "CCIC SINGAPORE PTE. LTD.",
        "Company ID": "60216815",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/4339cb3d-4d20-4415-9fc3-595ccd2b513b.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-04T09:06:37Z",
        "Job Salary": "$2,800 – $3,500 per month",
        "Job Teaser": "Support and maintain existing web and in-house applications, back end Web/ API development and integration testing, and to maintain application server",
        "Job Type": "Contract/Temp",
        "Job URL": "https://www.jobstreet.com.sg/job/74194049",
        "Job Details Sections": [
            "Job Responsibilities:",
            "Support and maintain existing web and in-house applications, back end Web/ API development and integration testing as well as to maintain application server.",
            "To be involved in software development projects internally and with external vendors.",
            "To develop programs / scripts to enhance the effectiveness of application and databases.",
            "Ensure program requirement specification is correctly documented.",
            "Perform data extraction for reporting needs.",
            "Monitor development progress and ensure program is delivered on time, thoroughly tested and according to specification.",
            "Ensure application development work follows the policies and standards.",
            "Job Requirements:",
            "Candidate must possess at least Diploma in Information Technology or equivalent with minimum 1 year of relevant working experience.",
            "Proficient in SQL Server, MySQL, ASP .Net, C#, VB Script, JSP, PHP, HTML 5 and Microsoft Office Macro.",
            "Candidate who is knowledgeable with the latest web, mobile, AI technologies is desirable.",
            "Have a thorough understanding of current information system technologies such as Client/Server, relational database, web-based system and object-oriented design.",
            "Possess in-depth knowledge in software development cycle, process mapping and implement to post live support.",
            "Motivated, creative and innovative to apply IT skills on the ground.",
            "Contract role for 1 Year.",
            "We regret that only shortlisted candidates will be notified. We don’t accept any recruitment agency."
        ]
    },
    "74308838": {
        "Job Title": "Mobile App / Progressive Web App Developer",
        "Company Name": "BizCube Solutions Pte Ltd",
        "Company ID": "60279346",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/46479016-f402-45e5-82ec-5b8fe20a9f19.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T01:13:42Z",
        "Job Salary": "",
        "Job Teaser": "Mobile App / Progressive Web App Developer",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74308838",
        "Job Details Sections": [
            "Mobile App / Progressive Web App Developer",
            "",
            "Job Responsibilities:",
            "Design, develop and maintain mobile applications for iOS and Android platforms.",
            "Be up to date with emerging trends in mobile technology and in particular, Progressive Web Apps.",
            "Identify and fix bugs and ensure the stability and reliability of the applications.",
            "",
            "Requirements:",
            "Mobile application development experience required.",
            "Strong foundation in design principles.",
            "Experience with IONIC platform a plus.",
            "Experience with calling third party APIs and integrating with APIs a strong plus.",
            "Experience with Progressive Web Apps (PWA) a plus.",
            "Knowledge in front-end technologies: JavaScript, CSS/Sass, HTML5 a plus.",
            "Excellent team dynamics and interpersonal skills.",
            "Ability to adapt in a fast-paced environment.",
            ""
        ]
    },
    "74318425": {
        "Job Title": "Software Engineer (6-months contract for service / Up to $350 per day)",
        "Company Name": "HOPE Technik Pte Ltd",
        "Company ID": "60257926",
        "Company Area": "Jurong East",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/30ec5e2a-157c-4a32-b5ab-3a330dbc13c7.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T05:29:42Z",
        "Job Salary": "$7,000 – $7,700 per month",
        "Job Teaser": "Seeking for a software engineer that interested in short term outsource contract",
        "Job Type": "Contract/Temp",
        "Job URL": "https://www.jobstreet.com.sg/job/74318425",
        "Job Details Sections": [
            "Job Responsibilities:",
            "Gather software requirements and design solutions for modules and small software systems",
            "Develop and support software including applications, database integration, interfaces and new functionality enhancements.",
            "Write both internal and external technical documentation",
            "Deploy, install, and configure hardware and software system",
            "",
            "Requirements:",
            "Bachelor's degree or higher in Computer Science, Engineering, or a related field.",
            "Proficiency in programming languages such as Python, C++.",
            "Minimum 2 years of relevant experience",
            "Experience with wearable IMU sensors and motion capture systems, particularly Xsens DOTs IMU sensors, is preferred.",
            "Experience with desktop UI development frameworks such as Qt or Electron",
            "Strong background in software development, including data synchronization, algorithm development and user interface design.",
            "Knowledge of signal processing techniques, machine learning algorithms, and data analysis methodologies.",
            "Excellent problem-solving skills and the ability to work independently as well as part of a team.",
            "Strong communication skills and the ability to effectively collaborate with cross-functional teams."
        ]
    },
    "74262140": {
        "Job Title": "Full Stack Developer",
        "Company Name": "GoCode Pte Ltd",
        "Company ID": "61713620",
        "Company Area": "Hougang",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/db6e0b69-d008-460d-b2ec-91f83aebb303.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T02:55:01Z",
        "Job Salary": "$6,000 – $8,000 per month",
        "Job Teaser": "You will be a key member of the development team, responsible for designing, developing, and maintaining complex web applications.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74262140",
        "Job Details Sections": [
            "Job Highlights:",
            "Attractive Compensation & Benefit",
            "Joining a growing company in a growing industry",
            "Good and Positive working culture",
            "Position Overview:",
            "As a Full Stack Developer, you will be a key member of the development team, responsible for designing, developing, and maintaining complex web applications. You will contribute to all stages of the software development lifecycle, from gathering requirements and designing architecture to implementing features and ensuring high-quality code. Your deep understanding of both front-end and back-end technologies will enable you to provide technical guidance, mentorship, and make architectural decisions. You will also play a crucial role in designing, implementing, and maintaining robust and scalable infrastructure solutions to support the development and deployment of software applications. You will be responsible for creating and managing efficient development workflows, ensuring smooth integration between development and operations teams, and automating processes to streamline software delivery. Additionally, you will contribute to the architectural decisions and provide technical leadership to the team.",
            "Responsibilities:",
            "Collaborate with stakeholders, including product managers, designers, and other developers, to gather and analyze requirements, and translate them into technical specifications and implementation plans.",
            "Design, develop, and maintain scalable and efficient web applications, both on the front-end and back-end, using appropriate technologies, frameworks, and programming languages.",
            "Implement user interfaces with a focus on usability, responsiveness, and cross-browser compatibility, using modern front-end frameworks such as React, Angular, or Vue.js.",
            "Develop server-side logic and APIs using back-end technologies like Node.js, Go, or Java, ensuring robustness, security, and high performance.",
            "Design and optimize databases, including data modeling, querying, and performance tuning, using SQL or NoSQL databases.",
            "Ensure code quality and maintainability through code reviews, testing, and adherence to coding standards and best practices.",
            "Provide technical guidance, mentorship, and support to junior developers, fostering their growth and helping them improve their skills.",
            "Troubleshoot and resolve complex technical issues, working closely with team members to identify root causes and implement effective solutions.",
            "Monitor and optimize the performance, availability, and scalability of the application infrastructure, including servers, databases, and networking components.",
            "Troubleshoot and resolve infrastructure and deployment issues, perform root cause analysis, and implement preventive measures to minimize future incidents.",
            "Implement security best practices and ensure compliance with relevant standards and regulations throughout the development and deployment process.",
            "Stay up to date with industry trends and emerging technologies related to DevOps and software development, and evaluate their potential to enhance existing systems and processes.",
            "Qualifications:",
            "Bachelor's degree in Computer Science, Engineering, or a related field. Equivalent work experience may be considered.",
            "Proven experience as a Full Stack Developer, DevOps Engineer, or similar role, with a strong focus on building and maintaining infrastructure for web-based applications.",
            "Proficiency in multiple programming languages, such as Java, Python, JavaScript (vue.js), or GO Lang, and experience with modern web frameworks (e.g., Laravel, React, or Node.js).",
            "Strong understanding of cloud computing platforms, such as AWS, Azure, or Google Cloud, and experience with deploying applications in cloud environments.",
            "Hands-on experience with containerization technologies like Docker and container orchestration platforms such as Kubernetes.",
            "Solid understanding of networking principles, database management systems, and server administration (Linux/Unix and/or Windows).",
            "Excellent problem-solving and troubleshooting skills, with the ability to analyze complex systems and identify practical solutions.",
            "Strong communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholders.",
            "Proven ability to provide technical leadership, mentorship, and guide the team in implementing best practices and industry standards."
        ]
    },
    "74100133": {
        "Job Title": "Software Developer",
        "Company Name": "Visier Pte. Ltd.",
        "Company ID": "61435980",
        "Company Area": "Downtown Core",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/c1d3a22d-5bce-46d3-b300-f984e172f1f5.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-02-28T23:13:12Z",
        "Job Salary": "",
        "Job Teaser": "Visier are seeking skilled Developers to join our Singapore team and play a key role in advancing our generative AI digital assistant, known as Vee!",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74100133",
        "Job Details Sections": [
            "Visier is the leader in people analytics and we believe in a 'people-first' approach to business strategy. Our innovative technology transforms the way that organisations make decisions, allowing them to elevate their employees and drive better business outcomes.  Embarking on an exciting new chapter in our growth story, we are looking for talented individuals who can help both Visier and our customers grow, evolve and win!",
            "We are at the forefront of developing a generative AI digital assistant for people analytics, known as Vee, which delivers rapid, user-friendly insights to HR leaders. Vee leverages natural language processing and generative AI to provide accurate narrative answers. Vee provides this unique insight by leveraging people data extracted from various data sources and providers. Visier is seeking smart, passionate, and skilled developers to join our Singapore team and play a key role in advancing this transformative technology.",
            "What you’ll be doing….",
            "Developing the core technology for innovative, high-performing, cloud-based applications in generative AI and machine learning",
            "Engineering prompt retrieval and augmentation",
            "Creating effective tests for prompts",
            "Integrating Vee with third-party tools and frameworks",
            "Developing and maintaining data connectors to various data sources",
            "Contributing innovative ideas to enhance features, product, technology, and processes",
            "What you’ll bring to the table….",
            "Proficiency in Python, Java, or Scala",
            "Strong knowledge of data structures and algorithms",
            "Exceptional problem-solving and critical-thinking skills",
            "Ability to excel in a fast-paced, proactive work environment",
            "Commitment to disciplined and top-quality software development",
            "Strong communication skills",
            "A solid academic background with a Bachelor's degree in Computer Science or equivalent",
            "Additional assets would include",
            "experience with prompt engineering and LLMs,",
            "LLM application frameworks such as LangChain,",
            "prompt testing,",
            "functional programming languages,",
            "knowledge of various HR data sources and providers and their APIs, and",
            "client-server programming, as well as familiarity with modern web technologies (REST, JSON, Angular, CSS, JavaScript, TypeScript, RXJS)",
            "Most importantly, you share our values...",
            "You roll up your sleeves",
            "You make it easy",
            "You are proud",
            "You never stop learning",
            "You play to win"
        ]
    },
    "74224774": {
        "Job Title": "Software Engineer (Robotics/IoT)",
        "Company Name": "HOPE Technik Pte Ltd",
        "Company ID": "60257926",
        "Company Area": "Jurong East",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/30ec5e2a-157c-4a32-b5ab-3a330dbc13c7.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T08:09:11Z",
        "Job Salary": "$5,200 – $6,300 per month",
        "Job Teaser": "We’re hiring for software engineer from robotics/IoT backgrounds who are experienced in developing and deploying mid-large scale software systems.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74224774",
        "Job Details Sections": [
            "Gather software requirements and design solutions for modules and small software systems",
            "Develop and support software including applications, database integration, interfaces and new functionality enhancements.",
            "Coordinate cross-functionally to ensure projects meet business objectives and compliance standards.",
            "Write both internal and external technical documentation",
            "Deploy, install, and configure hardware and software systems",
            "Work with team members in customer support, field test and deployment",
            "Perform bug fixing and improvement of current application framework",
            "Bachelor Degree in Computer Science & Engineering, Electrical & Electronics Engineering, Information Technology, or equivalent",
            "2-4 years of experience in design & developing software applications using C++/Python",
            "1-3 years of experience in developing applications using ROS",
            "Proficient in two mainstream programming languages, preferably Python, C++, Typescript, Javascript , etc.",
            "Background understanding of frontend engineering(React/Typescript)",
            "Basic Knowledge in writing unit and integration tests",
            "Experience of interfacing with different hardware using REST/HTTPS and MQTT communication protocols",
            "Fully understanding and fundamentals on software engineering.  Good software design (module, sub-system and small systems) and documentation skills.",
            "Understanding the networking communication technology, preferably TCP/IP",
            "Able to use tools to manage source code, preferably Git, GitHub Good analytical and problem solving skills",
            "Experience working in Linux environment",
            "Excellent problem analysis and innovation skills",
            "Added bonus: Knowledge on Agile & DevOps methodologies",
            "Added bonus: Knowledge on SQL and NoSQL database systems"
        ]
    },
    "74102264": {
        "Job Title": "Senior Software Developer",
        "Company Name": "Visier Pte. Ltd.",
        "Company ID": "61435980",
        "Company Area": "Downtown Core",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/c1d3a22d-5bce-46d3-b300-f984e172f1f5.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-02-28T23:15:14Z",
        "Job Salary": "",
        "Job Teaser": "We are seeking experienced Developers to join our Singapore R&D hub, playing a key role in advancing our generative AI digital assistant, named Vee!",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74102264",
        "Job Details Sections": [
            "Visier is the leader in people analytics and we believe in a 'people-first' approach to business strategy. Our innovative technology transforms the way that organisations make decisions, allowing them to elevate their employees and drive better business outcomes.  Embarking on an exciting new chapter in our growth story, we are looking for talented individuals who can help both Visier and our customers grow, evolve and win!",
            "We are at the forefront of developing a generative AI digital assistant for people analytics, known as Vee, which delivers rapid, user-friendly insights to HR leaders. Vee leverages natural language processing and generative AI to provide accurate narrative answers. Vee provides this unique insight by leveraging people data extracted from various data sources and providers. Visier is seeking smart, passionate, and skilled senior developers to join our Singapore team and play a key role in advancing this transformative technology.",
            "What you’ll be doing….",
            "Developing the core technology for innovative, high-performing, cloud-based applications in generative AI and machine learning",
            "Engineering prompt retrieval and augmentation",
            "Creating effective tests for prompts",
            "Integrating Vee with third-party tools and frameworks",
            "Developing and maintaining data connectors to various data sources",
            "Mentoring our junior software developers",
            "Establishing good development practices in the team",
            "Gathering requirements and designing new software features",
            "Contributing innovative ideas to enhance features, product, technology, and processes",
            "What you’ll bring to the table….",
            "7+ years of experience in designing and developing SaaS applications",
            "Proficiency in Python, Java, or Scala",
            "Strong knowledge of data structures and algorithms",
            "Exceptional problem-solving and critical thinking skills",
            "Ability to excel in a fast-paced, proactive work environment",
            "Commitment to disciplined and top-quality software development",
            "Strong communication skills",
            "A solid academic background with a Bachelor's degree in Computer Science or equivalent",
            "Additional assets would include",
            "experience with prompt engineering and LLMs,",
            "LLM application frameworks such as LangChain,",
            "prompt testing,",
            "functional programming languages,",
            "knowledge of various HR data sources and providers and their APIs, and",
            "client-server programming, as well as familiarity with modern web technologies.",
            "Most importantly, you share our values...",
            "You roll up your sleeves",
            "You make it easy",
            "You are proud",
            "You never stop learning",
            "You play to win"
        ]
    },
    "74272697": {
        "Job Title": "Senior Software Engineer (C++ Visual Studio) - DSC/JS/9502",
        "Company Name": "ST Engineering Training & Simulation Systems Pte Ltd",
        "Company ID": "60498094",
        "Company Area": "Ang Mo Kio",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/5e6940a2-b04b-44d9-9181-293c187aaff3.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T06:58:08Z",
        "Job Salary": "",
        "Job Teaser": "Design, and development of Graphical User Interfaces for Flight Instructor and Operator use.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74272697",
        "Job Details Sections": [
            "The Instructor Operator Station (IOS) is the main interface in which Flight Instructors and Operators will use, to perform planning, controlling of the training environment, observation, and instruction delivery to pilot trainees within a simulator system. We are looking for someone to join us as a Software Engineer, to co-build solutions together with our IOS team members. These solutions will contribute to our state-of-the-art Air Simulator project’s delivery to our end users.",
            "Job Responsibilities:",
            "Design, and development of Graphical User Interfaces for Flight Instructor and Operator use.",
            "Working closely to solicit inputs from Flight Instructors and Operators, to provide solutions suitable for their training delivery and execution needs.",
            "Working closely with other simulator subsystem teams, to ensure proper integration with the various simulator subsystem components (e.g. communication systems, networking, bots, etc).",
            "Adopting the various software development tools, approaches, and software frameworks that the company project team uses (e.g. gRPC, databases, microservices, PRISM framework etc)",
            "Adopting UI/UX best practises",
            "Generating engineering documentation within the team, to document the various requirements, design, and test areas to be developed",
            "Overseas travel for training, meetings or deployment can be expected",
            "Job Requirements:",
            "At least 3 years of software engineer experience",
            "Good knowledge or practical experience in C# and/or C++ will be a plus",
            "A willingness to learn and develop software in primarily C# and sometimes C++, and learning good programming practices and techniques over time, to ensure efficient performance in a 60-fps simulation/game environment",
            "A willingness to learn a wide array of technology and technology areas, which can range from frontend to backend software development.",
            "While company-sponsored training courses and guidance will be provided, independent learning and being a team player is required, to fit into the team’s culture",
            "Being comfortable to engage and communicate with end users, customers will be a plus"
        ]
    },
    "74262785": {
        "Job Title": "Golang Full Stack Developer",
        "Company Name": "GoCode Pte Ltd",
        "Company ID": "61713620",
        "Company Area": "Paya Lebar",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/db6e0b69-d008-460d-b2ec-91f83aebb303.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T03:10:55Z",
        "Job Salary": "$8,000 – $11,000 per month",
        "Job Teaser": "As part of this position, you will be involved in a comprehensive range of HR functions, including but not limited to recruitment, onboarding...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74262785",
        "Job Details Sections": [
            "As a Golang Full Stack Developer, you will be a key member of the development team, responsible for designing, developing, and maintaining complex web applications. You will contribute to all stages of the software development lifecycle, from gathering requirements and designing architecture to implementing features and ensuring high-quality code. Your deep understanding of both front-end and back-end technologies will enable you to provide technical guidance, mentorship, and make architectural decisions. You will also play a crucial role in designing, implementing, and maintaining robust and scalable infrastructure solutions to support the development and deployment of software applications. You will be responsible for creating and managing efficient development workflows, ensuring smooth integration between development and operations teams, and automating processes to streamline software delivery. Additionally, you will contribute to the architectural decisions and provide technical leadership to the team.",
            "",
            "Responsibilities:",
            "Collaborate with stakeholders, including product managers, designers, and other developers, to gather and analyze requirements, and translate them into technical specifications and implementation plans.",
            "Design, develop, and maintain scalable and efficient web applications, both on the front-end and back-end, using appropriate technologies, frameworks, and programming languages.",
            "Implement user interfaces with a focus on usability, responsiveness, and cross-browser compatibility, using modern front-end frameworks such as React, Angular, or Vue.js.",
            "Develop server-side logic and APIs using back-end technologies like Node.js, Django, or Java, ensuring robustness, security, and high performance.",
            "Design and optimize databases, including data modeling, querying, and performance tuning, using SQL or NoSQL databases.",
            "Ensure code quality and maintainability through code reviews, testing, and adherence to coding standards and best practices.",
            "Provide technical guidance, mentorship, and support to junior developers, fostering their growth and helping them improve their skills.",
            "Troubleshoot and resolve complex technical issues, working closely with team members to identify root causes and implement effective solutions.",
            "Contribute to the documentation of code, architecture, and processes to facilitate collaboration, maintain knowledge, and support future development efforts.",
            "Create and manage infrastructure as code (IaC) using tools like Ansible and Terraform to automate provisioning, configuration, and deployment of infrastructure resources.",
            "Build and maintain CI/CD pipelines using tools such as Jenkins, GitLab CI/CD, or Azure DevOps to enable continuous integration, delivery, and deployment of software applications.",
            "Monitor and optimize the performance, availability, and scalability of the application infrastructure, including servers, databases, and networking components.",
            "Troubleshoot and resolve infrastructure and deployment issues, perform root cause analysis, and implement preventive measures to minimize future incidents.",
            "Implement security best practices and ensure compliance with relevant standards and regulations throughout the development and deployment process.",
            "Stay up to date with industry trends and emerging technologies related to DevOps and software development, and evaluate their potential to enhance existing systems and processes.",
            "",
            "Qualifications:",
            "Bachelor's degree in Computer Science, Engineering, or a related field. Equivalent work experience may be considered.",
            "Proven experience as a Full Stack Developer, DevOps Engineer, or similar role, with a strong focus on building and maintaining infrastructure for web-based applications.",
            "Proficiency in multiple programming languages, such as Java, Python, JavaScript, or GO Lang, and experience with modern web frameworks (e.g., Laravel, React, or Node.js).",
            "Strong understanding of cloud computing platforms, such as AWS, Azure, or Google Cloud, and experience with deploying applications in cloud environments.",
            "Hands-on experience with containerization technologies like Docker and container orchestration platforms such as Kubernetes.",
            "In-depth knowledge of CI/CD concepts and experience with implementing CI/CD pipelines using tools like Jenkins, GitLab CI/CD, or Azure DevOps.",
            "Solid understanding of networking principles, database management systems, and server administration (Linux/Unix and/or Windows).",
            "Excellent problem-solving and troubleshooting skills, with the ability to analyze complex systems and identify practical solutions.",
            "Strong communication and collaboration skills, with the ability to work effectively in cross-functional teams and communicate technical concepts to non-technical stakeholders.",
            "Proven ability to provide technical leadership, mentorship, and guide the team in implementing best practices and industry standards."
        ]
    },
    "74078133": {
        "Job Title": "Senior Software Developer",
        "Company Name": "ST Engineering Urban Solutions",
        "Company ID": "62248792",
        "Company Area": "Ang Mo Kio",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/8e352d19-8108-4920-aed0-9f2f9a25fe3e.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-02-28T02:57:05Z",
        "Job Salary": "",
        "Job Teaser": "The Senior Developer will be responsible for designing and developing railway on-train public address, networking, and information display systems.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74078133",
        "Job Details Sections": [
            "Job Description:",
            "Design and develop railway on-train public address, communications, networking, and information display systems",
            "Participate in product planning activities such as proof of concept, requirement definition, and design implementation",
            "Design and develop monitoring systems to be used for data analytics",
            "Support existing firmware modification & feature enhancements",
            "Work with development team members to define and document software requirements and design, ensuring that requirements are traceable in the design and implementation.",
            "Ensure that implementation conforms to the coding standards and engineering processes",
            "Job Requirement:",
            "At least 5 years of C++ experience. Knowledge of Object Oriented principals, data structures, and algorithms.",
            "Experience in network programming using TCP, UDP, and multicast.",
            "Strong understanding of cybersecurity principles and best practices.",
            "Familiarity with routing protocols and network topologies.",
            "Knowledge of embedded software development on X86 and ARM-based systems using Linux Operating Systems",
            "Knowledge of digital input/output, RS232/485 serial, i2c, and CANBus communications programming.",
            "Knowledge of Qt/QML GUI programming would be advantageous.",
            "Experience in WiFi stack or 5G would be advantageous"
        ]
    },
    "74252114": {
        "Job Title": "Full stack Developer",
        "Company Name": "Quinnox Solutions Pte Ltd",
        "Company ID": "60307528",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/4219444a-f314-4918-8c50-8004d724bceb.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T09:12:24Z",
        "Job Salary": "$4,000 – $6,000 per month",
        "Job Teaser": "Knowledge and Experience in the any of the below: React Native, React.js, Node.js, .NET Core, Java",
        "Job Type": "Contract/Temp",
        "Job URL": "https://www.jobstreet.com.sg/job/74252114",
        "Job Details Sections": [
            "Roles and Responsibilities",
            "Developing and implementing software applications based on client requirements",
            "Designing the components and interfaces of the applications",
            "Writing functional, clean and scalable code",
            "Creation and testing of software prototypes",
            "Analysing and troubleshooting any issues by developing scripts and database queries",
            "Collaborating with the deployment team on continuous integration",
            "Supporting the operations team for potential post-implementation issues",
            "Leading technical practices such as pair programming and test-driven development",
            "Contributing to the entire phase of the development lifecycle",
            "",
            "Expectations of Candidate",
            "2 years of extensive knowledge in one of the following frameworks, and its related libraries",
            "React Native (w/ native experiences)",
            "React.js (w/ cloud deployment tools)",
            "Node.js (w/ AWS certifications, containers, microservices)",
            ".NET Core (w/ Azure certifications, containers, microservices)",
            "Java (w/ Spring framework, cloud certifications, microservices)",
            "Or a proficiency in any other languages (frameworks) and willingness to pick up",
            "new technologies",
            "Strong knowledge of problem solving, algorithms and data structures",
            "Strong knowledge of data and network, relevant securities and best practices",
            "Experience with CI/CD, logging, monitoring practices and relevant tools",
            "Experienced in delivering high throughput and high availability production system",
            "Strong communication skills with both technical and non-technical stakeholders",
            "Able to contribute effectively in a fast-paced, deadline-driven, and agile environment"
        ]
    },
    "74222637": {
        "Job Title": "Full-Stack Developer (6295)",
        "Company Name": "Changi Airport Group (Singapore) Pte. Ltd.",
        "Company ID": "60501603",
        "Company Area": "Changi",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/a0eebf12-ee94-4e8b-aed9-66ba8d75f1fd.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T07:02:01Z",
        "Job Salary": "",
        "Job Teaser": "-",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74222637",
        "Job Details Sections": [
            "An exciting opportunity awaits you at Changi Digital Factory, where you will lead the digital transformation efforts of Changi Airport Group. In this role, you will contribute to Commercial and Operational digital applications and projects, revolutionizing our business and elevating the customer experience. Collaborating with like-minded enthusiasts in squads, you will reimagine how we serve our connected customers. As a digital disruptor, your focus will be on recreating and redefining our business to establish a lasting competitive advantage, with a specific emphasis on building applications for Changi's existing and new digital products.",
            "Responsibilities:•    Develop code based on design documentation for integration into desktop and mobile websites, as well as web applications.•    Understand cross-browser and cross-platform concepts and concerns.•    Ensure code and design quality through the execution of test plans.•    Exhibit a strong attention to detail and understanding of UX and visual design concepts, providing leadership perspective on front and backend technologies and their impact on the creative process.•    Collaborate closely with internal and external design, business, and technical counterparts.•    Adopt an agile approach: Develop, test, analyze, and iterate applications with the end objectives and key results in mind.",
            "Requirements:•    2-4 years of in-depth knowledge and experience in front-end and backend development for consumer-facing applications, including websites and mobile devices.•    Ability to solve complex development problems and produce high-quality code while pushing the technical boundaries of online applications.•    Proficiency in one or more programming languages; we use Python and JavaScript.•    Familiarity with AWS serverless components, e.g., development using DynamoDB, RDS, SNS, SQS, Cognito, S3, API Gateway, AppSync, Lambda with Python.•    Manage cloud resources with Infrastructure as Code, such as Terraform/AWS CDK.•    Development and consumption of RESTful web APIs.•    Implementation using GIT and working with continuous integration & deployment.•    Knowledge in frontend frameworks such as React and Next.JS.•    Knowledge in design frameworks such as Ant Design and Bootstrap.",
            ""
        ]
    },
    "74222724": {
        "Job Title": "Java Developer (6239)",
        "Company Name": "Changi Airport Group (Singapore) Pte. Ltd.",
        "Company ID": "60501603",
        "Company Area": "Changi",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/a0eebf12-ee94-4e8b-aed9-66ba8d75f1fd.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T07:05:04Z",
        "Job Salary": "",
        "Job Teaser": "-",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74222724",
        "Job Details Sections": [
            "Job Description•    Design and develop high-quality, efficient, and maintainable codes for Java-based applications•    Translate business requirements into working and scalable solutions and deliver on-time•    Identify and recommend improvements to existing code, architecture, and development practices•    Collaborate effectively and professionally in all forms of communication with technical team, business units and third-party partners•    Participate in L3 support",
            "Competencies/ Job Requirements•    At least 3 years of development experience in Java•    Excellent core Java and Java 8 or Java 11 skills is a must•    Experience in Spring Framework•    Experience in implementing and integrating with web services•    Experience in TDD, writing unit tests and using unit test frameworks•    Experience in Jenkins (CD/CI) for deploying java applications•    Experience developing microservices (using technologies such as Docker and Kubernetes)•    Experience using GIT•    Excellent debugging, troubleshooting and communication skills•    Working knowledge of Jackson, JAX-RS•    Must be comfortable using Linux and should be good with common Shell commands/Scripting•    Experience of Agile Development Methodologies•    Ability to solve problems creatively and effectively•    Ability to work effectively independently as well as in a team•    Attention to detail and highly organized to handle multiple tasks simultaneously"
        ]
    },
    "74314608": {
        "Job Title": "Associate Software Engineer",
        "Company Name": "CTC Global Pte. Ltd.",
        "Company ID": "60174355",
        "Company Area": "Bukit Merah",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/4b43cf6b-aa22-4486-a94d-83e356e38c7d.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T03:39:44Z",
        "Job Salary": "",
        "Job Teaser": "-",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74314608",
        "Job Details Sections": [
            "Report to a technical lead and/ or project manager and engage in the full life cycle software development and project implementation work assigned.",
            "Involvement in the requirement analysis phase to determine the implementation feasibility of functional specifications and proposed solutions.",
            "Highlight requirement gaps, disproportional construction efforts, technical challenges, and any other issues to the business analyst team.",
            "Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.",
            "Implement solutions by designing system specifications, standards, and programming.",
            "Engage customers to explain the rationale of proposed solutions or other technical issues.",
            "Coordinate and collaborate with other project team members throughout the project implementation to meet project goals.",
            "Engage in maintenance and support activities, which include troubleshooting and breakfix of software application systems when required.",
            "Improves operations by conducting systems analysis, and recommending changes in policies and procedures.",
            "Ensure compliance with best practices, approved frameworks, and re-useable components are employed in the development project.",
            "Requirements",
            "Hands-on experience with core competencies in software development using either:Core Java and J2EE (including JSP/ Servlets)Web MVC (Spring MVC, Struts)Object/ Relational Mapping frameworks (JPA, Hibernate, etc)RESTful APIs and Web servicesDHTML Javascript framework (Bootstrap, JQuery, ExtJS, Angular JS, DOJO, etc)ANT build tool",
            "Core Java and J2EE (including JSP/ Servlets)",
            "Web MVC (Spring MVC, Struts)",
            "Object/ Relational Mapping frameworks (JPA, Hibernate, etc)",
            "RESTful APIs and Web services",
            "DHTML Javascript framework (Bootstrap, JQuery, ExtJS, Angular JS, DOJO, etc)",
            "ANT build tool",
            "Familiar with both frontend and backend development. Good knowledge in the development of web-based or mobile application applications.",
            "Experience in full SDLC (requirement, design, develop, test, validate, deploy), and agile methodology.",
            "Familiar in working with end users to gather and document business & functional requirements, using entity relation diagrams, use cases, swim lanes etc, and mapping requirements to design.",
            "Must be able to work independently on the assignment – including communicating with end users, requirements, design, and development.",
            "Should be able to translate non-functional and functional requirements into design within enterprise context.",
            "Ability to multi-task, perform under pressure, and be a strong team player.",
            "Proficient in written and spoken English."
        ]
    },
    "74227059": {
        "Job Title": "Senior Software Engineer (Salesforce)",
        "Company Name": "UFINITY Pte Ltd.",
        "Company ID": "60337231",
        "Company Area": "Paya Lebar",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/443df4f4-0e1e-4bb4-bf7a-8193c0effbad.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T09:21:57Z",
        "Job Salary": "$5,000 – $7,000 per month",
        "Job Teaser": "-",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74227059",
        "Job Details Sections": [
            "Role Responsibilities",
            "Join us and be part of the family that believes in good software design, delivering quality well tested solutions. Help establish Ufinity as the trusted partner by constantly achieving a pinnacle of excellence in our ideas, solutions and services.",
            "As a Software Engineer with Ufinity, you will have the opportunity to help shape and deliver a quality solution to our clients. Your broad responsibilities will include:",
            "Joint software design and development;",
            "Testing and ensuring quality in the development lifecycle process; and",
            "Support and operate the software in the operational environment.",
            "Role Requirements:",
            "Possess at least a Bachelor’s Degree, Post Graduate Diploma, of Professional Degree in Computer Science / Information Technology, Engineering (Computer / Telecommunication) or equivalent with at least 2 years of relevant experience.",
            "Completed at least 1 project using Salesforce Service Cloud and experience in Salesforce configuration, customisation and integration via APIs; and understanding of Salesforce data model and security model, Apex, Visualforce, and Lightning components.",
            "The software developers should work closely with business analysts to understand business requirements and translate them into technical solutions. They also ensure that the solutions they configure and customise are scalable, maintainable, and secure.",
            "Those with more years of experience and past projects will be considered for a Senior Software Engineer role.",
            "Required skills:",
            "a.    Salesforce Platform App Builder",
            "b.    Salesforce JavaScript Developer I",
            "c.    Salesforce Platform Developer I",
            "d.    Salesforce Platform Developer II",
            "Please do state other certifications as well for example, Omnistudio, Service Cloud or other Salesforce certifications."
        ]
    },
    "74308507": {
        "Job Title": "Software Developer (Web Application) - Smart IR",
        "Company Name": "Marina Bay Sands Pte Ltd",
        "Company ID": "60501398",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/1b19a3ed-a326-4c30-9628-590c4db44d2e.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T01:00:38Z",
        "Job Salary": "",
        "Job Teaser": "Execute all software development related activities for the local MBS system/application projects whilst aligning to standards & best practices follow",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74308507",
        "Job Details Sections": [
            "At Marina Bay Sands, the primary responsibility of the Software Developer will be to execute all software development related activities for the local MBS system/application projects whilst aligning to standards & best practices followed within the organization.",
            "",
            "JOB SCOPE",
            "Responsible for the design, development, and testing of the software application.",
            "Participate in various phases of the Software Development Life Cycle (SDLC) for company IT projects and to interface with various project stakeholders such as 3rd party vendor suppliers, business users and other team members to perform the project activities.",
            "Documenting the application detailed solution design and specifications",
            "Troubleshoot the defects/incidents and resolving technical issues",
            "Experienced in deploying services and applications on windows server environment",
            "Adhere to, influence, and advocate internal software design & development standards, processes, and best practices such as but not limited to code re-use, scalability, portability, security, etc.",
            "Work closely with the application development team members and architects to develop code that is aligned to approved design and specifications.",
            "Work closely with the QA teams to ensure any defects highlighted in QA or UAT phases are remediated.",
            "Adhere to SDLC, project governance internal and regulatory guidelines, policies, and procedures.",
            "",
            "",
            "",
            "JOB REQUIREMENTS",
            "Bachelor’s Degree in Computer Science or equivalent in relevant discipline.",
            "5-7 years software development experience and can demonstrate strong understanding of requirements specification, design, coding, and testing of software application.",
            "Proficient in the usage of .Net technologies, ASP.NET MVC, .Net Core, C#, Java Script, AngularJS, Vue.js, Entity Framework, WCF, REST APIs and web services.",
            "Proficient in the usages of RDBMS – MS SQL.",
            "Applies well-defined and disciplined development, implementation, and production processes.",
            "Proven & demonstrable hands-on experience in developing high-availability, multi-tiered and secure web applications",
            "Good debugging and troubleshooting skills using IDEs such as Visual Studio.",
            "Good to have knowledge on tools such as Azure DevOps, Jenkins.",
            "Good written and oral communication skills.",
            "Ability to communicate with business users in non-technical terms.",
            "High degree of responsiveness to enquiries.",
            "Ability to work independently and as part of a team. Work well in a collaborative environment with internal and external stakeholders.",
            "",
            "",
            "Marina Bay Sands is committed to building a diverse, equitable and inclusive workforce, providing equal opportunities as we grow our talent base to match our growth ambitions in Singapore. Our employees are committed to adhere to and abide by all rules, regulations, policies and procedures, including the rules of conduct and business ethics of the Company."
        ]
    },
    "74252962": {
        "Job Title": "System / Software Developer (up $4500 + AWS, 12 mth to perm)",
        "Company Name": "RecruitFirst Pte. Ltd",
        "Company ID": "60173576",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/893b5b20-2175-4cbd-8489-6bf3f7679f10.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T10:00:27Z",
        "Job Salary": "$4,000 – $4,500 per month",
        "Job Teaser": "✔ Up to $4500 + AWS\n✔ Japanese MNC (12 mth ctt to perm)\n✔ East SG",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74252962",
        "Job Details Sections": [
            "✔ Up to $4500 + AWS",
            "✔ Japanese MNC (12 mth ctt to perm)",
            "✔ East SG",
            "",
            "",
            "",
            "Job Scope",
            "",
            "Full-Stack development",
            "Maintenance & Improvement of web-based applications",
            "Liaison with customers/app users",
            "Providing support to customers/app users",
            "Database designs/migration (future)",
            "Data integration pipeline improvement (future)",
            "",
            "",
            "Requirements",
            "",
            "Degree/ Diploma in computer science/ computer engineering / software engineering / Software design / data analytics / engineering",
            "Full-stack development experience is a must",
            "Fluent in Javascript & Python is highly desired",
            "Experience with structured databases (such as MySQL/MSSQL) is highly desired",
            "Experience with unstructured databases (such as MongoDB) is highly desired",
            "Knowledge of Flask framework for backend is a plus",
            "Knowledge of Vue.JS framework for frontend is a plus",
            "Knowledge of database dimensional modelling using star schema is a plus",
            "",
            "",
            "*To apply, send your CV/Resume to josephyap[at]recruitfirst.com.sg with reason(s) for leaving past employments, last drawn and expected salary.",
            "",
            "All applications will be treated with strictest confidentiality. We regret that only shortlisted candidates will be notified. Thank you.",
            "",
            "RecruitFirst Pte Ltd E.A. 13C6342",
            "Joseph Yap Shi Hao (R1767577)",
            ""
        ]
    },
    "74194011": {
        "Job Title": "Senior/Software Analyst  (Technical Analyst)",
        "Company Name": "Cargo Community Network Pte Ltd",
        "Company ID": "60183553",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/0e6bba24-0023-4dc9-9bd4-4b38bae06321.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-04T08:59:23Z",
        "Job Salary": "",
        "Job Teaser": "We are seeking for experienced Software Analysts to join our Software Architect team to develop software solutions and ensuring compliance with the...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74194011",
        "Job Details Sections": [
            "We are seeking for experienced Software Analysts to join our Software Architect team to develop software solutions and ensuring compliance with the Application / Data Architecture standards. Your main responsibilities include the following:",
            "· Work with Product Owner and Business Analyst to review and understand business requirements",
            "· Translate business requirements to software solutions including conceptual and detailed design, architecture pattern, and component integration",
            "strategies",
            "· Identify and escalate conflicts relating to software governance for action",
            "· Collaborate with the development team on application development and resolving technical challenges, provide technical clarifications, help to",
            "analyse and provide performance tuning and scalability improvements of codes and queries",
            "· Ensure system implemented is conformed to the solution design",
            "· Provide design and technical support when troubleshooting production issues with the development team",
            "· Evaluate new technology required in the software solutions and demonstrate technology concept with proof-of-concept codes",
            "· Provide technology sharing/training on software technology",
            "",
            "Technical Requirements",
            "· Bachelor’s degree in Computer Science, Software Engineering, or related field",
            "· 4 to 6 years of hands-on experience in software design and development using .Net C#/.Net CORE, React, Javascript/Typescript, MS SQL Server, web services, RESTful API",
            "· Experienced in system implementation with multithreading and concurrency handling",
            "· Able to independently analyse, identify, and take lead to create complete solutions that covers both functional and non-functional requirements",
            "· Strong interest in applying technology to improve the solutions to align to business goal",
            "· Able to handle multiple projects concurrently",
            "· Team player with strong organisation and interpersonal skills",
            "· Strong written and communication skills with various stakeholders",
            "Added Advantage",
            "· Familiar with IT Architecture principles and framework",
            "· Experience in designing or implementing technical solutions for the Logistics Industry",
            "· Experience in using design patterns & familiarity with OOAD development",
            "· Knowledge of Azure cloud implementation",
            "· Experience in mobile development",
            "· Familiar with agile development methodology"
        ]
    },
    "74252500": {
        "Job Title": "Software Developer (Android Mobile Application)",
        "Company Name": "AXS Pte Ltd",
        "Company ID": "60182846",
        "Company Area": "Singapore River",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/ef400427-58db-4998-9b4a-07a65dd77ca8.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T09:33:33Z",
        "Job Salary": "",
        "Job Teaser": "The successful candidate will assist the m-Apps team in mobile application development of AXS products using technologies like Java and Kotlin.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74252500",
        "Job Details Sections": [
            "Job Description",
            "Participate in new project developments and be part of the developer team for AXS products including m-Station",
            "Involved in Software framework design, optimization and full SDLC flow – from Conceptualization to delivery/post-launch support phase",
            "Understand and evaluate new industry trends in mobile technologies (Android & iOS), and to implement them into our applications",
            "Job Requirements",
            "Possess a Diploma or Degree in Computer Engineering / Computer Science / Information Technology or any other related fields",
            "Have some experience in building mobile applications",
            "Possess knowledge and experience in Mobile Application development for Android modern SDK, able to use both Java and Kotlin language for Android development",
            "Have experience use Flutter to develop mobile application will be an added advantage",
            "Possess web technologies (PHP / HTML / CSS / AJAX / XML) will be an added advantage",
            "Preferably have good working knowledge of Java / C++ / C# or other Object-oriented programming"
        ]
    },
    "74236684": {
        "Job Title": "Fullstack Software Developer",
        "Company Name": "Michael Page International Pte Ltd",
        "Company ID": "60486925",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/e21ae6d2-bca6-4642-9bdb-58b200f7fb64.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T01:25:46Z",
        "Job Salary": "$5k - $6500 p.m. + Insurance",
        "Job Teaser": "Design, develop and maintain web applications and innovative software that save lives!",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74236684",
        "Job Details Sections": [
            "Design, develop and maintain web applications and innovative software that save lives!",
            "Client Details",
            "Singapore based company, established in 2000, running in b2b health technology sector.",
            "Description",
            "Work closely with other developers, designers and product manager to deliver projects, translate functional requirements to technical specifications.",
            "Design, develop and maintain secure, efficient and scalable Java based backend systems and APIs, manage integration with device for real-time and secure data transmission to web portal.",
            "Work on server side logic, database interaction and data storage solutions to manage and analyze data collected from iOT devices, ensure seamless integration NodeJS / VueJs and other front end components.",
            "Work on the development of User Interfaces (NodeJS / VueJS)",
            "Work with hardware engineers relating to communication protocols and device connectivities.",
            "Work on technical documentations relating to design, process and technical specifications.",
            "",
            "",
            "Profile",
            "Ideally possessed Bachelor Degree in Computer Science or related fields, Diploma holder are welcome as well.",
            "Minimum 3 years of working experience in Software Development.",
            "Good communication skills and able to collaborate well.",
            "Good problem solving skills, showing eagerness to learn and adopt new technology skills.",
            "Technology Skills : Java, VueJS, NodeJS, Spring, Angular, React, HTML5, Python, C#, C++, DevOps tools.",
            "",
            "Job Offer",
            "Working for a good cause, with innovative product that save lives.",
            "Steep learning curve, working on a lean team.",
            "RnD frameworks.",
            "Michael Page International Pte Ltd (Company No. 199804751N) is acting as an Employment Agency in relation to this vacancy. To apply online please click the 'Apply' button. For a confidential discussion about this role please contact Adinda Prastantri (Lic No: R23117878/ EA No.: 18S9099) on +65 6416 9820."
        ]
    },
    "74182379": {
        "Job Title": "Software Developer",
        "Company Name": "Fusion Trade Pte Ltd",
        "Company ID": "60501153",
        "Company Area": "Others",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/dae1b27d-21ec-4e7f-a4b0-0d1feab67005.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-04T03:09:57Z",
        "Job Salary": "$6,000 – $8,000 per month",
        "Job Teaser": "Opportunity to join a global and rapidly growing company in the electronic components industry.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74182379",
        "Job Details Sections": [
            "At Fusion Worldwide, we are dedicated to helping our customers overcome their biggest electronic component supply chain challenges. Coming on the heels of massive growth, we are looking for a Software Developer to be part of a development team working on our proprietary software system. This is a great opportunity to help a growing global company utilize cutting edge technology to solve high value business problems. Our current systems are currently based on a combination of a Win Forms-based front end and .NET web service with SQL Server-based back end. We will be evolving to a Blazor-based front end in the medium-term future and expect developers to be part of this evolution.",
            "",
            "What We Can Do For You",
            "Opportunity to join a global and rapidly growing company in the electronic components industry.",
            "Be part of the evolution to a Blazor-based front end.",
            "Be the subject matter expert to roll out Asia region IT Projects.",
            "Collaborative and motivated team in strategic locations around the world.",
            "",
            "What You Can Do For Us",
            "Developing, optimizing, and debugging applications and/or services under the .NET framework.",
            "Develop intuitive software that meets and exceeds the needs of the company.",
            "Analyze and test program, troubleshoot coding problems quickly and efficiently to ensure a productive workplace.",
            "Identify new technologies and actively seek ways to improve business software processes and interactions.",
            "Preparing reports on programming project specifications, activities, or status.",
            "Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.",
            "",
            "Who we are looking for",
            "Bachelor’s degree in computer science (or related field) or equivalent experience",
            "3+ years of software experience",
            "Strong knowledge of C# Coding Language, Win forms-based application development and Visual Studio.",
            "Proficiency in MS SQL server, XML, backend coding including web services.",
            "Knowledge of REST/JSON and 3rd party toolkits such as TELERIK",
            "Attention to detail, resourcefulness and troubleshooting aptitude.",
            "",
            "Benefits:",
            "Medical and Dental benefits",
            "State of the Art Open Concept Working Environment",
            "Collaborative and Motivated Team",
            "Attire: Smart Casual",
            "Walking distance from Tai Seng train station",
            "",
            "We regret that only shortlisted applicants will be notified."
        ]
    },
    "74307740": {
        "Job Title": "Software Engineer",
        "Company Name": "D'Crypt Pte Ltd",
        "Company ID": "60470465",
        "Company Area": "Bishan",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/39a84b04-528f-43f7-ad4b-e62d293e7f22.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T00:32:26Z",
        "Job Salary": "",
        "Job Teaser": "NA",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74307740",
        "Job Details Sections": [
            "D’Crypt is a high-value design and development house. We work with our customers to deliver state-of-the-art cryptographic technology and components that become an integral part of our customer's information security appliances, systems, and applications.",
            "We have openings for Software Engineers to join our highly talented R&D team. The candidate will work on software and firmware development for security products in D’Crypt.",
            "Responsibilities",
            "Design, develop and test software for embedded systems",
            "Interact with internal and external stakeholders to understand requirements and translate the requirements into technical specification",
            "Write user manuals and technical documentation",
            "Adhere to software design, development and testing processes",
            "Collaborate with project team members to optimize overall product performance",
            "Requirements",
            "Degree in Computer Science, Computer Engineering or any related discipline",
            "At least 2 – 3 years working experience in software development and testing",
            "Proficiency in C/C++ and Python",
            "Experience with software development on embedded Linux platforms",
            "Familiarity with software life cycle development methodologies and secure coding principles",
            "Excellent teamwork skills and able to collaborate in cross-functional team",
            "Strong problem-solving skills",
            "Good written, verbal communication skills in English",
            "Good to Have",
            "Experience with V2X communication protocol",
            "Experience with full-stack web app development",
            "Knowledge of network protocols, network switching/routing, network segmentation",
            "Proficiency in JavaScript"
        ]
    },
    "74192353": {
        "Job Title": "Software Developer",
        "Company Name": "Zetta Solution Pte Ltd",
        "Company ID": "60532995",
        "Company Area": "Bishan",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/865bfa38-cdac-4db9-bfa5-19b1fff9f2bf.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-04T07:37:10Z",
        "Job Salary": "",
        "Job Teaser": "We are hiring Software Developers to support our daily operations.Responsibilities: Provide Technical Support and enhance Application Software...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74192353",
        "Job Details Sections": [
            "We are hiring Software Developers to support our daily operations.",
            "",
            "Responsibilities:",
            "Provide Technical Support and enhance Application Software, including In-house Projects (ERP, POS, CRM etc.)",
            "Develop customized front and back-end Software for Key Projects",
            "Understand user requirements and develop system specifications for their requirements",
            "Documentation of Software Development and Product Design",
            "Monitor the progress of team members",
            "",
            "Job Requirements:",
            "Diploma or Degree in Computer Science or its equivalent",
            "Min. 3 years working experience in Software Development life cycle",
            "Deep understanding of front-end development tools and technologies",
            "Strong attention to detail with great problem-solving skills",
            "Excellent spoken and written English",
            ""
        ]
    },
    "74214475": {
        "Job Title": "IT Engineer / Software Developer [ Microsoft Dynamics Nav ]",
        "Company Name": "The Supreme HR Advisory Pte Ltd",
        "Company ID": "60174258",
        "Company Area": "Hougang",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/99a2edc3-dc1b-4586-bd8b-818084be4356.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T03:26:36Z",
        "Job Salary": "$4,000 – $5,600 per month",
        "Job Teaser": "Support Microsoft Dynamic Navision ERP system, and produce Jet Reports",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74214475",
        "Job Details Sections": [
            "Position title : IT Engineer / Software Developer (Micrsoft Dynamics Nav)",
            "Location: Joo Seng Road (Near Tai Seng mrt)Working Days: Monday - FridayWorking hours : 9am -6pmSalary : $4,000-$5,600",
            "Responsibilities:",
            "Support Microsoft Dynamic Navision ERP system, and produce Jet Reports",
            "Support and implement new EDI solutions and applications. Develop and maintain EDI integration using XML",
            "Hardware and software installation and maintenance.",
            "Requirement",
            "Minimum Diploma in IT",
            "Ideally, also has experience in hardware and software installation and maintenance.",
            "Must be strong in Navision Application support in manufacturing (inventory, warehouse management, production), finance, purchasing, sales support.",
            "Web development knowledge an added advantage.",
            "",
            "Interested Personal kindly email to : [email protected]Lydia Chieng Zhi Yee Reg No: R1988890The Supreme HR Advisory Pte Ltd EA No: 14C7279"
        ]
    },
    "74308106": {
        "Job Title": "Software Engineer",
        "Company Name": "Private Advertiser",
        "Company ID": "",
        "Company Area": "N/A",
        "Company Logo": "N/A",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-08T00:42:57Z",
        "Job Salary": "$3,000 – $4,500 per month",
        "Job Teaser": "Responsibilities: 1) To program and coding the Cashless Payment and Smart Electronics Parking System for Southeast Asia.2) To participate excited...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74308106",
        "Job Details Sections": [
            "Responsibilities:",
            "",
            "1) To program and coding the Cashless Payment and Smart Electronics Parking System for Southeast Asia.",
            "2) To participate excited product development in Traffic and Highway Related product.",
            "3) To develop Web-based and Native-based platform software.",
            "4) To debug & continue improving the system by understand the user and market requirement, then create and enhance the user experience for the system.",
            "5) To participate Software Design, prototyping mockup the product, weekly review the design for the best product delivery.",
            "6) To work closely with others department and oversea engineers for solution design.",
            "",
            "Requirements:",
            "",
            "1) Bachelor's degree in computer science or related discipline",
            "2) Hands-on programming experience using C++, Delphi/Pascal, PHP with frameworks (Yii and Laravel)",
            "3) Knowledge and experience in hybrid mobile app development (Flutter) is value added.",
            "4) In depth knowledge in Object Oriented Programming",
            "5) Excellent knowledge of relational databases, MySQL",
            "6) Debugging and problem-solving skills.",
            "",
            ""
        ]
    },
    "74247638": {
        "Job Title": "Software Engineer",
        "Company Name": "Biobot Surgical Pte Ltd",
        "Company ID": "60278439",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/95e2fdf9-3cfe-4dc4-a62c-a84883bc8429.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T06:19:52Z",
        "Job Salary": "$4,800 – $6,300 per month",
        "Job Teaser": "Software Engineer",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74247638",
        "Job Details Sections": [
            "Software Engineer – Job Description",
            "Duties and responsibilities:Involved in design and development of requirements that improve on our software UroX suite. Maintenance and improvement of software code that are developed by third-party vendors.Any other software development tasks assignedDocument software designs and code changes.Examples of work:3D visualization.Develop algorithms making use of artificial intelligence. Image processing, including image segmentation, multi-planar reconstruction, fusion of MRI with ultrasound, pattern recognition, and visual overlaysRobotic control of a programmable electro-mechanical system User interface designHandle data connectivity e.g. to PACS / hospital networks, with considerations of cybersecurityCompliance with relevant regulatory standards such as IEC 62304 – medical device software – software life cycle processes",
            "Involved in design and development of requirements that improve on our software UroX suite.",
            "Maintenance and improvement of software code that are developed by third-party vendors.",
            "Any other software development tasks assigned",
            "Document software designs and code changes.",
            "Examples of work:",
            "3D visualization.",
            "Develop algorithms making use of artificial intelligence.",
            "Image processing, including image segmentation, multi-planar reconstruction, fusion of MRI with ultrasound, pattern recognition, and visual overlays",
            "Robotic control of a programmable electro-mechanical system",
            "User interface design",
            "Handle data connectivity e.g. to PACS / hospital networks, with considerations of cybersecurity",
            "Compliance with relevant regulatory standards such as IEC 62304 – medical device software – software life cycle processes",
            "Software Qualifications and Skills",
            "Bachelor’s and/or Master’s degree in Computer Science, Computer Engineering or related technical discipline.",
            "At least 3 years of working experience in the related area.",
            "Proficiency in C++.",
            "Experience in Qt, Vtk, C# and Python will be an added advantage.",
            "Strong background in mathematics.",
            "Experience in image analysis, algorithm design 3D visualization, AI techniques, machine learning, computer vision algorithms will be an advantage.",
            "Other requirements",
            "Good communication skills and can work well with others.",
            "Fast learner and independent personality."
        ]
    },
    "74239895": {
        "Job Title": "Software Engineer",
        "Company Name": "AIT Technologies Pte Ltd",
        "Company ID": "60531554",
        "Company Area": "Geylang",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/a96e3571-25af-4919-abf0-3dc5885474be.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T03:00:26Z",
        "Job Salary": "SGD 3,000 - 4,500",
        "Job Teaser": "The Software Engineer will be responsible for designing, developing, and maintaining software applications.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74239895",
        "Job Details Sections": [
            "Responsibilities:",
            "Participate in the software design, coding and testing",
            "To develop software module or applications and hardware drivers",
            "Generate software requirement specification, design documents and test specification",
            "Troubleshoot and resolve customers' issues through root cause analysis",
            "To conduct technical training to project team members and end users",
            "To conduct User Acceptance Test",
            "",
            "Requirements:",
            "Candidate must possess at least professional certificate, diploma, post graduate diploma, computer science or information technology or equivalent",
            "Required asp.net, javascript and mssql",
            "Develop server side API and web services",
            "At least 1 year working experience in related fields is required for this position",
            "Strong analytical and communication skills."
        ]
    },
    "74274925": {
        "Job Title": "Telecom Solution Developer",
        "Company Name": "SPTel Pte Ltd",
        "Company ID": "60545718",
        "Company Area": "Ang Mo Kio",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/50c41fc4-f08e-4212-99d5-bb0a59845573.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T07:24:14Z",
        "Job Salary": "",
        "Job Teaser": "This position offers the unique opportunity to contribute to the end-to-end development process, from conceptualization to deployment.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74274925",
        "Job Details Sections": [
            "Job Brief:",
            "As a Telecom Solution Developer, you will play a pivotal role in developing and implementing OSS automation solutions that enhance our capabilities in service fulfillment and assurance. This position offers the unique opportunity to contribute to the end-to-end development process, from conceptualization to deployment, of solutions that significantly impact our operational excellence and customer satisfaction.",
            "Responsibilities:",
            "Design and develop automation solutions for OSS processes, focusing on service fulfillment and assurance.",
            "Collaborate with cross-functional teams to gather requirements, define specifications, and translate business needs into technical solutions.",
            "Develop and integrate APIs for seamless interaction between OSS components and other systems.",
            "Implement and refine algorithms that drive automation and optimization of network operations.",
            "Conduct thorough testing and validation of developed solutions to ensure reliability and effectiveness.",
            "Participate in the deployment of OSS automation solutions, including configuration, customization, and troubleshooting.",
            "Document development processes, configurations, and procedures for internal use and knowledge sharing.",
            "Stay abreast of the latest trends and advancements in telecom OSS technologies and automation practices.",
            "Any other ad-hoc duties as assigned by superior from time to time.",
            "",
            "Role Requirements:",
            "Bachelor’s degree in computer science, Software Engineering, Telecommunications, or a related field.",
            "Strong foundation in software development principles and a keen interest in telecom OSS.",
            "Proficiency in programming languages such as Java, Python, or similar, with a focus on developing scalable and efficient solutions.",
            "Basic understanding of telecommunications networks, protocols, and services.",
            "Excellent problem-solving abilities and a detail-oriented mindset.",
            "Strong communication skills and the ability to work collaboratively in a team environment.",
            "Experience with or exposure to OSS/BSS systems in a telecom environment.",
            "Knowledge of network operations, service fulfillment processes, and assurance practices.",
            "Familiarity with DevOps practices and tools for continuous integration and continuous deployment (CI/CD)."
        ]
    },
    "74282021": {
        "Job Title": "Backend Developer",
        "Company Name": "Merry Electronics (Singapore) Pte Ltd",
        "Company ID": "60510903",
        "Company Area": "Bukit Batok",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/6cd1d5d1-bc6f-4144-b605-4c33aaaefbd8.1/jdpLogo",
        "Company Classification": "Engineering",
        "Listing Date": "2024-03-07T08:38:10Z",
        "Job Salary": "$5,000 – $6,500 per month",
        "Job Teaser": "Develop and maintain high-quality backend applications in the AWS cloud.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74282021",
        "Job Details Sections": [
            "Responsibilities:",
            "Develop and maintain high-quality backend applications in the AWS cloud",
            "Collaborate with cross-functional teams to define, design, and ship new features",
            "Ensure the performance, quality, and responsiveness of applications",
            "Identify and correct bottlenecks and fix bugs",
            "Help maintain code quality, organization, and automatization",
            "Continuously discover, evaluate, and implement new technologies to maximize development efficiency",
            "Stay updated with the latest trends and best practices in backend development",
            "Troubleshoot, debug and upgrade existing software",
            "Create technical documentation for reference and reporting",
            "Ability to communicate effectively in writing and orally",
            "Requirements:",
            "Bachelor’s degree in Computer Science, Software Engineering, or related field",
            "Proven experience (3+ years) as a Software Developer, with expertise in backend development",
            "Strong proficiency in Python and C#",
            "Experience in AWS services such as S3, API Gateway, RDS, etc.",
            "Familiarity with Agile/Scrum methodologies",
            "Familiarity with REST service api",
            "Ability to write and execute SQL/Mongo DB queries to validate data",
            "Knowledge of Unit Test, User-Driven Development",
            "Experience with Agile methodology or similar lean approach to building software.",
            "Ability to learn new languages and technologies and able to work independently",
            "Excellent problem-solving and communication skills",
            "Being resourceful and able to find efficient ways to overcome challenges"
        ]
    },
    "74223413": {
        "Job Title": "Full Stack Developer",
        "Company Name": "EV MART PTE.LTD",
        "Company ID": "60561860",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/0b8efa77-96ad-434a-95f5-8e7475e2bf32.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T07:25:58Z",
        "Job Salary": "SGD 4,000 - 6,000",
        "Job Teaser": "We are looking for a highly skilled, innovative, creative, self-motivated and independent programmer who is confident with both front and back-end...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74223413",
        "Job Details Sections": [
            "We are looking for a highly skilled, innovative, creative, self-motivated and independent programmer who is confident with both front and back-end programming in building E-Commerce websites. Full-stack developers are responsible for developing and designing front and back-end web architecture, ensuring the responsiveness of applications.",
            "",
            "Full-stack developer will be required to see out projects from conception to final product, requiring good organizational skills and attention to each and every details.",
            "",
            "Duties and Responsibilities:",
            "Developing client-side and server-side architecture",
            "Developing of web, mobile applications and e-commerce websites",
            "Primarily involved in design, development, testing, deployment, and support",
            "Improve web sites according to user and management feedback",
            "Designing user interactions on web pages",
            "Developing front and back-end website applications",
            "Efficiently implement and execute highly effective strategies and researching cutting-edge search marketing techniques",
            "Ability to deliver highest possible search and high quantities of targeted traffic to our websites through the Search Marketing and Web Development services, search, social and mobile results",
            "Creating servers and databases for functionality",
            "Ensuring cross-platform optimization for mobile phones",
            "Ensuring responsiveness of applications",
            "Seeing through projects from conception to finished product",
            "Designing and developing APIs",
            "Meeting both technical and consumer needs",
            "Staying abreast of developments in web applications and programming languages",
            "",
            "Requirements:",
            "3-5 years of working experience on the above position",
            "Strong organizational, project management skills with strong capability to lead and train up a team.",
            "Proficiency with fundamental front-end languages such as HTML, CSS, and JavaScript",
            "Familiarity with frameworks such as Angular JS, React, Django, Flask",
            "Proficiency with server-side languages such as ASP, Python, Ruby, Java, PHP, and Net and other latest server-based technologies.",
            "Familiarity with database technology such as MySQL, Oracle, MongoDB , SQLite",
            "Proficiency in using and customizing CMS platforms like (WordPress, and Magento)",
            "Excellent verbal communication skills",
            "Independent, self-oriented, self-driven, and motivated individual and able to work within tight schedules.",
            "Good problem-solving and analytical skills"
        ]
    },
    "74268187": {
        "Job Title": ".Net Developer",
        "Company Name": "Exasoft Pte. Ltd.",
        "Company ID": "60562470",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/ae0bd79b-ca78-4db9-98cb-48d45e2a34b8.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T06:11:37Z",
        "Job Salary": "$6,000 – $7,300 per month",
        "Job Teaser": ".Net Developer for IT Consulting company based in North East of Singapore. Interviews happening this week and next week.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74268187",
        "Job Details Sections": [
            "As a Software Engineer, the broad area of your job responsibilities should cover the following: Project Delivery",
            "Analyse process/program specifications & translate specifications to program codes, conforming to program guidelines and programming best practices",
            "Make changes to configurable items, which include hardware, software, documentation, etc. It covers configuration management planning, configuration identification, configuration controls & audits",
            "Develop unit test package, execute tests & document test results to ensure the quality of the program",
            "Assist in the integration testing, system testing, User Acceptance Test (UAT) & implementation activities to fix the reported problems/bugs of the system to ensure the smooth execution of programs in the production environment",
            "Investigate all reported problems/errors & initiate amendments & testing so that the system can operate correctly & efficiently",
            "Prepare & maintain up-to-date system documentation.",
            "Analyse functional requirements to translate into application design using established design methodologies and guidelines",
            "Ensure codes comply with NCS security guidelines",
            "Teamwork",
            "Work with team lead to ensure design and programme codes conform to architecture and design standards, and that design satisfies functional and system requirements",
            "Participate in requirements gathering; work with Business Analysts in reviewing and refining functional specifications",
            "Participate in peer reviews to improve project quality",
            "The ideal candidate should have/possess the following:",
            "2-4 years of working experience in developing and delivering application software",
            "Possess relevant system development experience using .NET-related technologies",
            "Possess initiative and disposition with a strong commitment and orientation towards results and high-quality standards",
            "Strong problem-solving skills and ability to think out of the box",
            "Team player with strong communication and interpersonal skills",
            "Self-motivator with a positive attitude and with high energy",
            "Customer focused",
            "Proficient in written and spoken English",
            "Diploma / Degree in Computer Science / Computer Engineering / Information Technology related field, or IT equivalent",
            "Interested candidates pls send your CV to [email protected] for faster processing.",
            ""
        ]
    },
    "71981876": {
        "Job Title": "Senior Software Developer (Frontend / Flutter)",
        "Company Name": "Cyberbot Pte Ltd",
        "Company ID": "62180266",
        "Company Area": "Downtown Core",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/1fab85ed-4d55-48ee-9b48-31488fead270.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-01T06:08:56Z",
        "Job Salary": "$6,000 – $9,000 per month",
        "Job Teaser": "Senior Frontend developer plans, designs, builds, and implements the user interface systems of websites, software programs, and web-based applications",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/71981876",
        "Job Details Sections": [
            "The role:",
            "",
            "The Senior Front-end developer plans, designs, builds, and implements the user interface systems of websites, software programs, and web-based applications. He is to lead a team of junior engineers to provide a satisfactory user experience with no issues, errors, or downtime.",
            "",
            "He creates and optimizes systems, plays an active role in testing and troubleshooting, and resolves issues such as those related to accessibility and browser compatibility. He often serves as an intermediary bridging the gap between the user and the backend developers, and tweaks tools and platforms to adapt to real-world use situations.",
            "",
            "Job Responsibilities:",
            "",
            "Responsible for the development and maintenance of the core modules of mobile products, code review, and writing relevant technical documents;",
            "Responsible for optimizing the quality, performance and user experience of mobile products;",
            "Using Dart programming language for multi-platform development",
            "Responsible for the performance experience optimization of the Flutter engine and framework,",
            "Monitoring platform construction, and the exploration of underlying new technologies;",
            "Responsible for the development of Flutter's basic library, engineering experience, R&D toolchain, etc.;",
            "Work on frontend services platform and application development",
            "Oversee the web and mobile application architecture",
            "Challenging programming and software design problems",
            "Provide support for critical application problems and issues",
            "Provide operational support for web systems and application platforms",
            "Analyze users' needs and design software",
            "Promote software design/testing/coding best practices",
            "Demonstrate great maturity and skill in software design and development practice",
            "Debug and troubleshoot software issues",
            "Paying attention to software development process practiced by the team",
            "Assist in the authoring of software tools that reliably manage application delivery",
            "Utilize the appropriate frameworks to develop reusable software packages and software services",
            "",
            "Job Requirements:",
            "",
            "Bachelor’s degree or above, major in computer, communication, mathematics, etc.;",
            "Good data structure and algorithm foundation, solid programming skills;",
            "Four or more years of Android or iOS development experience, with complete commercial-grade mobile phone application or game development project development experience;",
            "Have solid programming skills, good code style, and strong ability to analyze and solve problems;",
            "Familiar with iOS or Android system mechanisms and features, proficient in UI, network, XML/JSON parsing and other development technologies;",
            "Familiar with the Flutter framework and Dart language, proficient in using various Flutter layouts and animations, and have a certain understanding of Java or OC;",
            "Possess demand analysis and system design capabilities, as well as strong logical analysis and independent problem-solving capabilities;",
            "Positive and optimistic, strong sense of responsibility, serious and meticulous work, good team communication and collaboration skills;"
        ]
    },
    "74146994": {
        "Job Title": "Software Developer (Java)",
        "Company Name": "Talent Trader Group Pte Ltd",
        "Company ID": "60216044",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/39d919d1-49b5-4fee-a121-08e49948da62.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-01T06:35:22Z",
        "Job Salary": "$5,000 – $7,000 per month",
        "Job Teaser": "Hybrid Working Environment \nAttractive staff benefits",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74146994",
        "Job Details Sections": [
            "Responsibilities:",
            "Design, develop, document, test, deploy, and maintain software applications.",
            "Follow through the entire Software Development Life Cycle.",
            "Finalising back-end features and testing web applications.",
            "Keep up to date on best practices and new technologies.",
            "Interpret systems specifications to develop, maintain and support application implementation.",
            "",
            "Requirements:",
            "Diploma / Degree in Computer Science or related field.",
            "Minimum 2 years of relevant experience.",
            "Familiar with J2EE Framework such as Spring Boot, Servlet, Hibernate, etc.",
            "Familiarity with RESTful APIs.",
            "Strong documentation and solution design skills.",
            "",
            "Interested candidates who wish to apply for the advertised position, please click APPLY to submit your resume.",
            "EA License No.: 13C6305",
            "Reg No: R23118161",
            "For candidate who applied for the advertised position is deemed to have consented to us that we may collect, use or disclose your personal information for purpose in connection with the services provided by us."
        ]
    },
    "74195190": {
        "Job Title": "Software Engineer (Full Stack Web)",
        "Company Name": "Anacle Systems Limited",
        "Company ID": "60510249",
        "Company Area": "Queenstown",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/0a2f4994-f3f6-4c29-a864-b98a648c21d0.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-04T09:32:24Z",
        "Job Salary": "$4,500 – $6,700 per month",
        "Job Teaser": "Job Description Develop web application prototypes, new technologies and products. Build highly responsive and scalable web applications. Build...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74195190",
        "Job Details Sections": [
            "Job Description",
            "Develop web application prototypes, new technologies and products.",
            "Build highly responsive and scalable web applications.",
            "Build fully functional web applications with interfaces to backend database, writing clean and maintainable code.",
            "Build fully functional, clear, testable backend RESTful/SOAP APIs with interfaces to backend database.",
            "Resolve defects, and generally ensure accuracy, integrity, interoperability and completeness of system.",
            "Build regularly automated tasks to perform functions specific to the project requirements.",
            "Build interfaces to exchange data between various third-party systems.",
            "Resolve defects, and generally ensure accuracy, integrity, inter-operability and completeness of system.",
            "Troubleshoot and debug to optimize performance.",
            "Prepare and deliver software related documentation.",
            "Provide timely updates to the web and backend application.",
            "Provide support and maintenance of existing software web application projects.",
            "Respond to users in a timely manner.",
            "Work with fellow software engineers to coordinate the development effort and ensure overall consistency in the coding and the interfacing between various components and sub-systems in order to achieve a full functioning solution.",
            "Work with consultants to craft user stories, assess feasibility and build demonstration showcases.",
            "Work with consultants and senior engineers to develop test scenarios to ensure full functionality of system before user acceptance test.",
            "Work with customers and partners, both internal and external where there will be collaboration for knowledge transfer.",
            "",
            "Essential Skills and Experience",
            "At least a Diploma, Advanced/Higher/Graduate Diploma, Bachelor's Degree, Post Graduate Diploma or Professional Degree in Engineering (Computer/Telecommunication), Computer Science/Information Technology or equivalent.",
            "Entry Level or up to 2 years of relevant working experience.",
            "Tech Stack Requirements: ASP.NET Framework 4.5 or .NET Core, C#, HTML, CSS, Javascript, SQL Server.",
            "Good problem solving, logical reasoning, planning and time management skills.",
            "Effective communication and technical writing skills.",
            "Strong interest in software engineering.",
            "Willingness to learn on the job, and constantly eager to learn new skills on one’s own.",
            "Ability to work well in teams and also independently in a fast-paced environment.",
            "Familiarity with mobile application development (with Xamarin) is a plus.",
            "Familiarity with backend API development (with .NET technologies) is a plus.",
            "Domain knowledge in accounting, or procurement, or inventory management, or leasing, or computerized maintenance management, or billing, or resource booking, or Enterprise Resource Planning is a plus.",
            "",
            "Only shortlisted candidates will be notified"
        ]
    },
    "74091962": {
        "Job Title": "Software Engineer",
        "Company Name": "ST Engineering Defence Aviation Services Pte. Ltd",
        "Company ID": "60541925",
        "Company Area": "Paya Lebar",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/6ec35b49-ad54-42c0-9b9b-8250cadc09b3.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-02-28T10:22:06Z",
        "Job Salary": "$4,400 – $6,500 per month",
        "Job Teaser": "You will be responsible for execution of a full SDLC, including designing, developing, maintaining mission-critical software for aircraft applications",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74091962",
        "Job Details Sections": [
            "Job Summary (DA/JW/14016)",
            "We are seeking talented Software Engineer(s) to join our dynamic team based in Singapore. The ideal candidate will have a passion for software development, aerospace technologies and a willingness to learn. Some working experience is preferable but not essential. You will be responsible for execution of a full SDLC (Software Development Life Cycle), including designing, developing, and maintaining mission-critical software for aircraft applications. Join us for the opportunity to make a meaningful impact in the aerospace and defence industry.",
            "",
            "Key Responsibilities:",
            "Collaborate with cross-functional teams to gather requirements and define software specifications for aircraft mission-critical systems.",
            "Design and develop robust, scalable, and efficient software solutions that meet aerospace industry standards and regulatory / authority requirements.",
            "Implement real-time software, data processing software, and control systems software for onboard and offboard aircraft applications.",
            "Perform thorough testing and validation of software components to ensure reliability, safety, and performance under various operating conditions.",
            "Participate in DevOps / DevSecOps activities, including continuous integration, deployment automation, and security enhancements.",
            "Document design processes, including development, testing, analytics, and troubleshooting.",
            "Conduct code reviews, provide constructive feedback, and contribute to a culture of continuous improvement and knowledge sharing.",
            "Work closely with hardware/firmware engineers and avionics systems engineers to integrate software with onboard avionics systems and ensure seamless functionality.",
            "Stay updated on the latest advancements in aerospace technology, software engineering best practices, and industry trends and standards to drive innovation and competitiveness. (e.g. Kubernetes, Docker, Type 1 Hypervisors, DDS, ARINC 653, Generative AI).",
            "Overseas travel or deployment can be expected.",
            "",
            "Qualifications:",
            "Bachelor's or Master's degree in Computer Science, Computer Engineering, or equivalent field.",
            "Singapore citizenship is required for this position.",
            "2 to 6 years of working experience in software development is preferable but not essential.",
            "Entry level candidates with relevant experience are welcome to apply.",
            "Proficient in C/C++, Python, and Dot Net programming languages/frameworks, with a willingness to learn other software technologies as needed.",
            "Expertise in developing, testing and debugging production-quality, scalable, multi-threaded, concurrent systems.",
            "Able to apply Object Oriented Software design patterns effectively.",
            "Proficient in identification of code smells and effective in code refactoring.",
            "Familiarity with software development methodologies including Agile, and experience working in Agile environments, version control systems, software test frameworks, and software testing techniques.",
            "Interest in DevOps / DevSecOps practices and a willingness to contribute to related activities.",
            "Strong analytical thinking and problem-solving skills, with a keen attention to detail and a commitment to delivering high-quality results.",
            "Excellent communication skills and the ability to collaborate effectively with multidisciplinary teams.",
            "Able to work under tight deadlines while coordinating several projects at a time and responding to changing business and technical conditions.",
            "You are a self-motivated, independent, and high-performing individual. You learn quickly and enjoy solving worthy challenges.",
            "",
            "The following skillsets would be an added advantage:",
            "Experience with network troubleshooting/problem resolutions, protocol analysis, network troubleshooting/problem determination skills with network trace/capture/analysis software (Familiarity with network security technologies and products is a plus).",
            "Experience with distributed systems concepts and client-server architectures.",
            "Knowledge of relational databases, SQL, JSON, XML and XPath for handling of both structured and unstructured data.",
            "",
            "Location: This position is based mainly in Singapore (Paya Lebar), with travel opportunities.",
            "",
            "Benefits:",
            "Competitive salary and performance-based bonuses",
            "Comprehensive insurance plans and health / dental benefits",
            "Professional development opportunities",
            "Exciting projects and the opportunity to make a meaningful impact in the aerospace and defence industry",
            "",
            "How to Apply: Interested candidates are to submit their resume and a cover letter detailing their relevant experience and why they are passionate about joining our team. Please include examples of your work or projects that demonstrate your expertise in software development."
        ]
    },
    "74236695": {
        "Job Title": "Software Engineer",
        "Company Name": "Daviscomms (S) Pte Ltd",
        "Company ID": "60501052",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/6bb7e2e5-6478-4e7a-b138-5b24052355fe.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T01:26:27Z",
        "Job Salary": "",
        "Job Teaser": "SOFTWARE ENGINEER Design and development of firmware for LTE/GPS/BLE/ Wi-Fi /Zigbee/sub-GHz Transceivers, base band and audio/video products....",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74236695",
        "Job Details Sections": [
            "SOFTWARE ENGINEER",
            "Design and development of firmware for LTE/GPS/BLE/ Wi-Fi /Zigbee/sub-GHz Transceivers, base band and audio/video products.",
            "Design software for PC and Mac OS, Android and iOS mobile applications.",
            "Define and design the user interface, functional and test requirement specifications and operation sequence of the wireless and audio/video products.",
            "Implement database management system and artificial intelligence technologies into backend server.",
            "The requirements:",
            "Degree in Electrical/Electronic or Computer Engineering.",
            "At least 2 years direct work experience with embedded system development.",
            "No experience candidates with good aptitude will be considered.",
            "Experience in Android, iOS, Mac OS, Windows OS, micro-controller, C++, and Assembly languages is an added advantage.",
            "Knowledge in telecommunications protocol implementation (TCP/IP, LTE, Wi-Fi, Zigbee, VoIP), and experience with Android, RTOS and Linux OS and finite state machines (FSM) are preferred.",
            "Independent, good team player and self-disciplined to succeed.",
            "",
            "This is open to Singaporeans only."
        ]
    },
    "74258769": {
        "Job Title": "Full Stack Web Developer",
        "Company Name": "Creative Technology Group of Companies",
        "Company ID": "60483001",
        "Company Area": "Jurong East",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/9321de1b-75fe-4dd9-b158-f349ae1da499.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T01:09:37Z",
        "Job Salary": "",
        "Job Teaser": "If you are passionate about web technologies and is excited about getting your hands dirty in implementing them, this job is for you.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74258769",
        "Job Details Sections": [
            "We are looking for highly-motivated, passionate and savvy full-stack developers to support both our customer-facing web sites as well as our internal back-end systems. If you are passionate about web technologies and is excited about getting your hands dirty in implementing them, this job is for you.",
            "Responsibilities",
            "·      Work closely with marketers and designers to build secure, user-friendly, scalable, and performant web applications using a variety of technologies",
            "·      Write clean, testable, and modular code.",
            "·      Make use of AI tools to improve customer user experience, as well as improve our workflow efficiency.",
            "·      Take full ownership of projects from design, to implementation, and deployment",
            "",
            "Required Skills",
            "·      Knowledge of front-end technologies like HTML 5/CSS3/JavaScript, and related front-end frameworks like Vue.js is a must.",
            "·      Experience with building customer-facing e-commerce websites using Node.js / Express.",
            "·      Experience with ASP.NET, or ASP.NET Core is a bonus.",
            "·      Experience and experience with REST API implementation, and working with APIs.",
            "·      Knowledge of RDMS and how to optimize the queries for performance.",
            "·      Knowledge and/or experience with Large Language Models (LLM) and related libraries (e.g. Open AI GPT, Anthropic Claude) and toolsets like LangChain will be an advantage.",
            "·      Good prompt-engineering skills will be a plus.",
            "·      Strong troubleshooting and analytical skills with a good attention to detail",
            "·      Working knowledge of web security best practices (e.g. OWASP)",
            "·      Knowledge of unit and integration testing tools and processes"
        ]
    },
    "74237655": {
        "Job Title": "Software Engineer",
        "Company Name": "Plant Werx Pte Ltd",
        "Company ID": "60482572",
        "Company Area": "Bukit Batok",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/c83caaf2-2cb7-4e96-88a8-4c33f08417bf.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-06T01:55:45Z",
        "Job Salary": "",
        "Job Teaser": "Plant Werx is looking for experienced Software Engineers to join our project team. Fresh graduates can also be considered in a junior position.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74237655",
        "Job Details Sections": [
            "PLANT WERX PTE LTD, established in year 2000, is a system integrator that provides design and programming services, integrating hardware and software for industrial processes. We are passionate about providing OT solutions that enhance manufacturing and business practices.",
            "As trusted partner for industrial automation and control solutions, Plant Werx delights its customers with A.C.T. service experience:",
            "Assured, experienced and competent consultants",
            "Creative, innovative and relevant solutions that create value",
            "Timely delivery of assignment.",
            "Among the services that we offer are:",
            "Industrial Automation Implementation",
            "Engineering Services",
            "Maintenance Support",
            "Project Management",
            "Automation Consultancy Services",
            "Business Continuity and Disaster Recovery",
            "",
            "Join our team!",
            "Our project team is on the lookout for new talent.",
            "",
            "Roles and Responsibilities",
            "PLC, SCADA Programming",
            "Engineering Design and Project Management",
            "Site Commissioning",
            "Willing to travel overseas when required",
            "Documentation of instruction and operation manuals",
            "Skills and Qualifications",
            "Diploma or Degree in Computer Science, Mechatronics or Electrical and Electronics Engineering",
            "A keen interest in Software and Computer Technology is a pre-requisite",
            "Must be a team player",
            "These skills are required to excel in the role:",
            "Process Control Automation Systems",
            "PLC (e.g. AB, ABB, Siemens)",
            "SCADA and MES (e.g. Wonderware and Rockwell)",
            "Database (e.g. Access and SQL)",
            "We look forward to meeting you!"
        ]
    },
    "74162779": {
        "Job Title": "(C#, .NET) Software Developer / Financial MNC",
        "Company Name": "RecruitPedia Pte Ltd",
        "Company ID": "60600002",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/ee5540bd-4924-476a-b1fe-26561fff4acd.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-02T00:16:46Z",
        "Job Salary": "$7,000 – $10,000 per month",
        "Job Teaser": "Easily assessible, attractive package.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74162779",
        "Job Details Sections": [
            "Our Client is a Financial Service MNC. Due to their current expansion plan, they are looking for a Software Developer (C#) to join their team, in hopes of developing the current high performing team. They are located in the Central.",
            "Responsibilities",
            "Responsible for developing new features on tooling and trading strategies.",
            "Design and produce new components within a distributed architecture based on microservices.",
            "Responsible in evolution of internal tools such as service frameworks, monitoring and continuous deployment systems and configuration management.",
            "Work and liaise with colleagues regionally.",
            "Any ad-hoc duty as assigned",
            "Requirement",
            "Min Diploma / Degree in Computer Science or relevant field",
            "Min 3 years of C# and .Net experience",
            "Interested candidates who wish to apply for the advertised position, please click APPLY NOW or email an updated copy of your resume/cv.",
            "We regret that only shortlisted candidate will be notified.",
            "Recruitpedia Pte. Ltd.",
            "EA License No. 19C9682",
            "EA Reg. No. R21103987 (Yan Yongmao)"
        ]
    },
    "71955919": {
        "Job Title": "Software Developer (Frontend / Flutter)",
        "Company Name": "Cyberbot Pte Ltd",
        "Company ID": "62180266",
        "Company Area": "Downtown Core",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/1fab85ed-4d55-48ee-9b48-31488fead270.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-01T06:08:56Z",
        "Job Salary": "$4,000 – $6,000 per month",
        "Job Teaser": "The Front-end developers plan, design, build, and implement the user interface systems of websites, software programs, and web-based applications.",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/71955919",
        "Job Details Sections": [
            "The role:",
            "",
            "The Front-end developers plan, design, build, and implement the user interface systems of websites, software programs, and web-based applications. Their primary goal is to provide a satisfactory user experience with no issues, errors, or downtime.",
            "",
            "They create and optimize systems, play an active role in testing and troubleshooting, and resolve issues such as those related to accessibility and browser compatibility. They often serve as an intermediary bridging the gap between the user and the backend developers, and tweak tools and platforms to adapt to real-world use situations.",
            "",
            "Job Responsibilities:",
            "",
            "Responsible for the development and maintenance of the core modules of mobile products, code review, and writing relevant technical documents;",
            "Responsible for optimizing the quality, performance, and user experience of mobile products;",
            "The main language is Dart, responsible for the performance experience optimization of the Flutter engine and framework, the monitoring platform construction, and the exploration of underlying new technologies;",
            "Responsible for the development of Flutter's basic library, engineering experience, R&D toolchain, etc.;",
            "",
            "Job Requirements:",
            "",
            "Bachelor's degree or above, major in computer, communication, mathematics, etc.;",
            "Good data structure and algorithm foundation, solid programming skills;",
            "Two or more years of Android or iOS development experience, with complete commercial-grade mobile phone application or game development project development experience;",
            "Have solid programming skills, good code style, and a strong ability to analyze and solve problems;",
            "Familiar with iOS or Android system mechanisms and features, proficient in UI, network, XML/JSON parsing, and other development technologies;",
            "Familiar with the Flutter framework and Dart language, proficient in using various Flutter layouts and animations, and have a certain understanding of Java or OC;",
            "Possess demand analysis and system design capabilities, as well as strong logical analysis and independent problem-solving capabilities;",
            "Positive and optimistic, strong sense of responsibility, serious and meticulous work, good team communication and collaboration skills;"
        ]
    },
    "74152783": {
        "Job Title": "Senior Software Developer (Java)",
        "Company Name": "Good Job Creations (Singapore) Pte Ltd",
        "Company ID": "60252422",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/ebf546e1-bf6b-4c62-9880-7a2d818e328f.2/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-01T09:33:53Z",
        "Job Salary": "$6,000 – $7,000 per month",
        "Job Teaser": "Central area (near MRT station)\nNew headcount for the department",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74152783",
        "Job Details Sections": [
            "Job order: 479362",
            "Responsibilities:",
            "Write well-designed, testable, efficient code and improve the quality of the code.",
            "Design and develop high-volume, low-latency applications for mission-critical systems",
            "Contributing to all phases of the development lifecycle.",
            "Analyse business requirements and create technical design documents",
            "Develop the code and provide hands-on engineering expertise to the development teams.",
            "Manage UAT User Queries & coordinate UAT Activities",
            "Perform unit and system testing of application code",
            "Record and track defects uncovered during the execution of tests and escalate the issue’s status to project management",
            "Review the code, enhance the system & performance.",
            "Involves in performance enhancement analysis.",
            "Any other ad-hoc assigned.",
            "Requirements",
            "Bachelor’s Degree in Computer Science or a related field",
            "At least 5 years of proven working experience in Java development",
            "Expert-level programming skills in Java",
            "Preferably with strong knowledge of Microservices architectures, hands-on experience in developing and deploying Microservices solutions, containerisation, Docker and Kubernetes",
            "We regret that only shortlisted candidates will be notified. However, rest assured that all applications will be updated to our resume bank for future opportunities",
            "EA Personnel Name: Chong Gui Feng",
            "EA Personnel Registration Number: R1768033",
            "EA License no.: 07C5771",
            ""
        ]
    },
    "74222676": {
        "Job Title": "Low Code Developer (Microsoft Power Platform) (6384)",
        "Company Name": "Changi Airport Group (Singapore) Pte. Ltd.",
        "Company ID": "60501603",
        "Company Area": "Changi",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/a0eebf12-ee94-4e8b-aed9-66ba8d75f1fd.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-05T07:03:49Z",
        "Job Salary": "",
        "Job Teaser": "-",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74222676",
        "Job Details Sections": [
            "Changi Airport Group’s (CAG) Power Platform Centre of Excellence (CoE) helps teams across CAG to streamline & re-engineer business processes, and designs & builds digital solutions and automations for these teams",
            "We are looking for a Power Platform Developer who will fit into our Power Platform CoE team of business analysts, support engineers and developers. You will be delivering solutions built on the Microsoft Power Platform, including, and not limited to, PowerApps, Power Automate, Power Virtual Agents, Power BI, Power Query, SharePoint, and Microsoft Teams.",
            "As the Power Platform Developer & Power Platform CoE team member, you will:",
            "Work with product owners and stakeholders to analyze existing processes and requirements",
            "Create business process flows to automate processes & design solution process using swim-lane diagrams",
            "Collaborate with user product teams to design and develop the solutions",
            "Develop and deploy Power Platform-based solutions based on swim-lane diagrams, user stories, wireframes and other requirements-specification artifacts",
            "Identify system deficiencies and recommend design changes",
            "Add new features and enhancements to deployed applications",
            "Assist team members with troubleshooting PowerApps/Automate related issues that may arise in the day to day running of Power Platform applications",
            "Run, contribute and participate in User Acceptance Testing (UAT), including performing quality assurance checks and code reviews of solutions built by other developers",
            "Work with IT colleagues to ensure that solutions are deployed into CAG’s Power Platform environment in accordance with IT governance procedures",
            "Share your Power Platform knowledge through training sessions, workshops and consults",
            "You should have:",
            "A degree in Computer Science, Engineering or any other related field, or equivalent software development experience",
            "2 or more years of front/back-end development experience, with at least 1 year of Microsoft Power Apps/Power Automate development experience and have developed & deployed at least 4 canvas apps",
            "Good to have experience in setting up and interfacing with SharePoint, Dataverse and SQL databases",
            "Good communication, presentation and stakeholders’ management skills required",
            "This role might be for you if:",
            "You derive immense satisfaction from building great software that your users love using",
            "You thrive on learning new things and look forward to sharing knowledge with others who may not be as experienced in low-code application development, especially on Microsoft’s Power Platform",
            "You are resourceful in working around the limits of your tools (e.g., Power Platform) and finding new and creative ways to achieve outcomes that others might not have thought possible",
            "You are an excellent team player, enjoy interactions with other developers and can work independently when the need arises",
            "You are patient with non-techie users",
            "It would be extra awesome if:",
            "You are passionate about UX design thinking",
            "You are constantly brimming with ideas, always have a couple of side coding projects that you’re working on, and regularly finish and deploy them into the world",
            ""
        ]
    },
    "74146635": {
        "Job Title": "Software Engineer",
        "Company Name": "WIZVISION PTE LTD",
        "Company ID": "60483937",
        "Company Area": "Kallang",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/1dafb74b-c511-4fed-89eb-42c5a7e7db6f.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-01T06:30:58Z",
        "Job Salary": "$4,000 – $6,000 per month",
        "Job Teaser": "Opportunity to be groomed as Project Leader",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74146635",
        "Job Details Sections": [
            "Responsibilities",
            "Participate in full project life cycle from requirements gathering to project implementation, maintenance and support.",
            "Be responsible for program design, coding, testing and documentation.",
            "Develop secure, scalable and good quality application programs and API within allocated man days.",
            "Perform data migration, data transformation and scripting.",
            "Have a passion for delivering zero defect codes and be responsible for ensuring the codes meet the expected SLA.",
            "Participate in continuous integration activities and automation frameworks for testing and deployment.",
            "",
            "The ideal candidate shall possess the following",
            "Diploma/Degree in Computer Science, IT or equivalent",
            "Good problem solving & communication skills.",
            "Good attitude and willingness to learn.",
            "Good knowledge in Java, JavaScript and SQL.",
            "Good knowledge in Angular and Struts framework"
        ]
    },
    "74267535": {
        "Job Title": "Junior/Mid-level Web Developer",
        "Company Name": "BLACKWELL GLOBAL SERVICES PTE. LTD.",
        "Company ID": "60536600",
        "Company Area": "N/A",
        "Company Logo": "https://bx-branding-gateway.cloud.seek.com.au/31e6349d-b77a-422f-a888-5bd959f3e296.1/jdpLogo",
        "Company Classification": "Information & Communication Technology",
        "Listing Date": "2024-03-07T05:46:47Z",
        "Job Salary": "$2,200 – $3,300 per month",
        "Job Teaser": "Responsibilities:  Take charge of front-end page layout and beautification in the project.  Integrate designer’s sliced HTML/Assets template with...",
        "Job Type": "Full time",
        "Job URL": "https://www.jobstreet.com.sg/job/74267535",
        "Job Details Sections": [
            "Responsibilities:",
            "Migrate/Take charge of front-end page layout and beautification in the project.",
            "Integrate designer’s sliced HTML/Assets template with backend API data response.",
            "Continuous enhancement to current application front-end using Vue.js(3.0).",
            "Maintain old WordPress system and migrate it to our in-house CMS system.",
            "Building reusable components and UI libraries for future use",
            "Design and build responsive web-based UI",
            "Optimizing components used/render for maximum performance across different devices and browsers.",
            "Collaborate with back-end development engineers to discuss system integration solutions, optimize compatibility, and system response performance.",
            "Enjoy taking up challenging problems that is new to the team and research/solve it together as a team will make your way up",
            "Partner with our marketing maestros to ensure brand consistency.",
            "",
            "Requirements:",
            "At least a Diploma, Advanced/Higher/Graduate Diploma, Bachelor's Degree, Post Graduate Diploma or Professional Degree in Engineering (Computer/Telecommunication), Computer Science/Information Technology or equivalent.",
            "At least 2 years of experience in software programming",
            "Experience working with any various language like (Vue.js/ Angular.js/ react.js/node.js)",
            "Good understanding of data structures, algorithms, and operating systems.",
            "Good interpersonal communication, strong sense of team spirit, and problem-solving skills.",
            "Proficiency in client-side web technologies (HTML5, SASS, typescript/javascript, webpack, ES6, etc…)",
            "Experience in modern development tools likes git, npm, yarn",
            "Customer experience-oriented and has a positive attitude for teamwork",
            "Solid understanding of RESTFUL API concepts is a plus",
            "Familiarity with backend API development (with Laravel technologies) is a plus."
        ]
    }
}